Repository: Fardim/sample-code-2022
Catalog: src/locale/messages.*.xlf
Languages: ar, id, ja, th, vi

source: Revoke
ar: سحب او إبطال
id: Mencabut
ja: 取り消す
th: ถอน
vi: Thu hồi

source: Activate
ar: تفعيل
id: Mengaktifkan
ja: アクティベート
th: เปิดใช้งาน
vi: Kích hoạt

source: Inactivate
ar: تعطيل
id: Nonaktifkan
ja: 非アクティブ化
th: ปิดใช้งาน
vi: Hủy kích hoạt

source: Deactivate
ar: تعطيل
id: Menonaktifkan
ja: 非アクティブ化
th: ปิดการใช้งาน
vi: Hủy kích hoạt

source: Invited
ar: مدعو
id: Diundang
ja: 招待
th: เชิญ
vi: Được mời

source: Pending Invitation
ar: دعوة معلقة
id: Undangan tertunda
ja: 保留中の招待
th: คำเชิญที่รอดำเนินการ
vi: Lời mời cấp phát

source: Resend Invitation
ar: اعادة ارسال الدعوة
id: Mengirim kembali undangan
ja: 招待状を再送する
th: ส่งคำเชิญอีกครั้ง
vi: Gửi lại lời mời

source: Revoke Invitation
ar: إبطال دعوة
id: Cabut Undangan
ja: 招待を取り消す
th: เพิกถอนคำเชิญ
vi: Thu hồi lời mời

source: First Name
ar: الاسم الأول
id: Nama depan
ja: ファーストネーム
th: ชื่อจริง
vi: Tên đầu tiên

source: Last Name
ar: الكنية
id: Nama keluarga
ja: 苗字
th: นามสกุล
vi: Họ

source: Joined
ar: انضم
id: bergabung
ja: 参加しました
th: เข้าร่วม
vi: Đã tham gia

source: Last Active
ar: آخر نشاط
id: Aktif Terakhir
ja: 最後にログインした時
th: ใช้งานล่าสุด
vi: Hoạt động cuối cùng

# team_title
source: Invite people to your team
ar: ادعُ الناس إلى فريقك
id: Undang orang ke tim Anda
ja: チームに人を招待する
th: เชิญคนเข้าร่วมทีมของคุณ
vi: Mời mọi người vào nhóm của bạn

# email_invalid
source: Email Address is not valid
ar: عنوان البريد الإلكتروني غير صالح
id: Alamat email tidak valid
ja: メールアドレスが無効です
th: ที่อยู่อีเมลไม่ถูกต้อง
vi: Địa chỉ Email không hợp lệ

source: Add Another
ar: أضف آخر
id: Tambahkan Lainnya
ja: 別の追加
th: เพิ่มอีกหนึ่ง
vi: Thêm cái khác

source: Add Multiple
ar: أضف مضاعفات
id: Tambahkan Banyak
ja: 複数追加
th: เพิ่มหลายรายการ
vi: Thêm nhiều

# multiple_email_input_instruction
source: Separate addresses with a comma
ar: عناوين منفصلة بفاصلة
id: Pisahkan alamat dengan koma
ja: 住所はカンマで区切ります
th: คั่นที่อยู่ด้วยเครื่องหมายจุลภาค
vi: Phân tách các địa chỉ bằng dấu phẩy

# error_sending_invite_email
source: There was an error with the email and the invite was not sent
ar: حدث خطأ في البريد الإلكتروني ولم يتم إرسال الدعوة
id: Ada kesalahan dengan email dan undangan tidak terkirim
ja: メールにエラーがあり、招待状は送信されませんでした
th: เกิดข้อผิดพลาดกับอีเมลและไม่ได้ส่งคำเชิญ
vi: Đã xảy ra lỗi với email và lời mời không được gửi

source: Field properties
ar: خصائص الحقل
id: Properti bidang
ja: フィールドプロパティ
th: คุณสมบัติของฟิลด์
vi: Thuộc tính trường

# field_id
source: ID
ar: هوية شخصية
id: Indo
th: NS
vi: TÔI

source: Field Length
ar: طول المجال
id: Panjang Lapangan
ja: フィールド長
th: ความยาวของสนาม
vi: Độ dài trường

# maximum_length
source: Input maximum length
ar: الحد الأقصى لطول الإدخال
id: Masukkan panjang maksimum
ja: 入力最大長
th: อินพุตความยาวสูงสุด
vi: Độ dài tối đa đầu vào

# select_data_type
source: Data Type
ar: نوع البيانات
id: Tipe data
ja: データ・タイプ
th: ประเภทข้อมูล
vi: Loại dữ liệu

source: Is Dependant?
ar: هل المعال؟
id: Apakah Ketergantungan?
ja: 依存していますか？
th: เป็นที่พึ่ง?
vi: Là phụ thuộc?

source: Display Criteria?
ar: عرض المعايير؟
id: Kriteria Tampilan?
ja: 表示基準？
th: เกณฑ์การแสดงผล?
vi: Tiêu chí hiển thị?

source: Is Styled Dropdown?
ar: هل نمط القائمة المنسدلة؟
id: Apakah Gaya Dropdown?
ja: スタイル付きドロップダウンですか？
th: ดรอปดาวน์สไตล์หรือไม่?
vi: Có phải menu thả xuống được tạo kiểu không?

source: Help Text
ar: نص المساعدة
id: Teks Bantuan
ja: ヘルプテキスト
th: ข้อความช่วยเหลือ
vi: Văn bản trợ giúp

source: Key
ar: مفتاح
id: Kunci
ja: キー
th: สำคัญ
vi: Chìa khóa

source: Tab Criteria Field
ar: حقل معايير علامة التبويب
id: Bidang Kriteria Tab
ja: タブ基準フィールド
th: ฟิลด์เกณฑ์แท็บ
vi: Trường tiêu chí tab

source: Workflow Criteria Field
ar: مجال معايير سير العمل
id: Bidang Kriteria Alur Kerja
ja: ワークフロー基準フィールド
th: เขตข้อมูลเกณฑ์เวิร์กโฟลว์
vi: Trường tiêu chí quy trình làm việc

source: Number Setting Criteria Field
ar: حقل معايير إعداد الرقم
id: Bidang Kriteria Pengaturan Angka
ja: 番号設定基準フィールド
th: ฟิลด์เกณฑ์การตั้งค่าตัวเลข Number
vi: Trường tiêu chí thiết lập số

# search_list_page
source: Search enabled
ar: تمكين البحث
id: Pencarian diaktifkan
ja: 検索が有効
th: เปิดใช้งานการค้นหา
vi: Đã bật tìm kiếm

source: Workflow Reference
ar: مرجع سير العمل
id: Referensi Alur Kerja
ja: ワークフローリファレンス
th: การอ้างอิงเวิร์กโฟลว์
vi: Tham chiếu quy trình làm việc

source: Permission Field
ar: مجال الإذن
id: Bidang Izin
ja: 許可フィールド
th: ช่องอนุญาต
vi: Trường quyền

source: Transient
ar: عابر
id: Sementara
ja: 一時的
th: ชั่วคราว
vi: Tạm thời

source: Mandatory
ar: إلزامي
id: Wajib
ja: 必須
th: บังคับ
vi: Bắt buộc

source: Multi-Selection
ar: متعدد التحديد
id: Multi-Pilihan
ja: マルチセレクション
th: เลือกได้หลายแบบ
vi: Nhiều lựa chọn

source: Completeness
ar: الاكتمال
id: Kelengkapan
ja: 完全
th: ความสมบูรณ์
vi: Sự hoàn chỉnh

# select_text_case
source: Text case
ar: حالة النص
id: Kasus teks
ja: テキストケース
th: กรณีข้อความ
vi: Trường hợp văn bản

# description_field
source: Description type
ar: نوع الوصف
id: Jenis deskripsi
ja: 説明タイプ
th: ประเภทคำอธิบาย
vi: Loại mô tả

source: Edit value
ar: تحرير القيمة
id: Sunting nilai
ja: 値を編集する
th: แก้ไขค่า
vi: Chỉnh sửa giá trị

source: List values
ar: سرد القيم
id: Daftar nilai
ja: リスト値
th: รายการค่า
vi: Liệt kê các giá trị

# new_value
source: New Values
ar: قيم جديدة
id: nilai baru
ja: 新しい値
th: ค่าใหม่
vi: giá trị mới

source: Value
ar: قيمة
id: nilai
ja: 値
th: ค่า
vi: giá trị

source: Click to edit...
ar: إضغط للتعديل...
id: Klik untuk mengedit...
ja: クリックして編集する...
th: คลิกเพื่อแก้ไข...
vi: Bấm vào để chỉnh sửa...

source: New Code
ar: رمز جديد
id: Kode Baru
ja: 新しいコード
th: รหัสใหม่
vi: Mã mới

# help_text_placeholder
source: Additional information for field, it will display on mouse hover of input
ar: معلومات إضافية للحقل ، سيتم عرضها عند تمرير الماوس فوق الإدخال
id: Informasi tambahan untuk bidang, itu akan ditampilkan pada masukan mouse hover
ja: フィールドの追加情報、入力のマウスホバーに表示されます
th: ข้อมูลเพิ่มเติมสำหรับฟิลด์ จะแสดงเมื่อวางเมาส์เหนืออินพุต
vi: Thông tin bổ sung cho trường, nó sẽ hiển thị khi di chuột của đầu vào

source: Password
ar: كلمة المرور
id: Kata sandi
ja: パスワード
th: รหัสผ่าน
vi: รหัสผ่าน

source: Verify Password
ar: اكد كلمة المرور
id: Verifikasi Kata Sandi
ja: パスワードを照合します
th: ยืนยันรหัสผ่าน
vi: Xác nhận mật khẩu

source: Set password and login
ar: قم بتعيين كلمة المرور وتسجيل الدخول
id: Setel kata sandi dan logiu
ja: パスワードを設定してログイン
th: ตั้งรหัสผ่านและเข้าสู่ระบบ
vi: Đặt mật khẩu và đăng nhập

source: Comments
ar: تعليقات
id: Komentar
ja: コメント
th: ความคิดเห็น
vi: Bình luận

# typing
source: is typing
ar: يكتب
id: sedang mengetik
ja: 打ち込んでいる
th: กำลังพิมพ์
vi: đang đánh máy

# enter_to_send
source: Hit Enter to send your message
ar: اضغط على Enter لإرسال رسالتك
id: Tekan Enter untuk mengirim pesan Anda
ja: Enterキーを押してメッセージを送信します
th: กด Enter เพื่อส่งข้อความของคุณ
vi: Nhấn Enter để gửi tin nhắn của bạn

# short_text
source: Name
ar: اسم
id: Nama
ja: 名前
th: ชื่อ
vi: Tên

source: Length
ar: طول
id: Panjang
ja: 長さ
th: ความยาว
vi: Chiều dài

source: Decimal Places
ar: منازل عشرية
id: Tempat desimal
ja: 小数位
th: ตำแหน่งทศนิยม
vi: Vị trí thập phân

source: View less
ar: عرض أقل
id: Lihat lebih sedikit
ja: 表示を減らす
th: ดูน้อยลง
vi: Xem ít hơn

source: View more
ar: عرض أقل
id: Lihat lebih banyak
ja: もっと見る
th: ดูเพิ่มเติม
vi: Xem thêm

# dataset_settings
source: Settings
ar: إعدادات
id: Pengaturan
ja: 設定
th: การตั้งค่า
vi: Cài đặt

# edit_dataset
source: Edit
ar: يحرر
id: Sunting
ja: 編集
th: แก้ไข
vi: chỉnh sửa

# systemDesc
source: System description
ar: وصف النظام
id: Deskripsi sistem
ja: システムの説明
th: คำอธิบายระบบ
vi: Sự mô tả hệ thống

source: System URL
ar: عنوان URL للنظام
id: URL Sistem
ja: システムURL
th: URL ระบบ
vi: URL hệ thống

source: Hostname URL
ar: عنوان URL لاسم المضيف
id: URL nama host
ja: ホスト名URL
th: URL ชื่อโฮสต์
vi: URL tên máy chủ

source: Just Now
ar: في هذة اللحظة
id: Baru saja
ja: ちょうど今
th: ตอนนี้
vi: Ngay bây giờ

source: In 1 hour
ar: في 1 ساعة
id: Dalam 1 jam
ja: 1時間で
th: ใน 1 ชั่วโมง
vi: Trong 1 giờ

source: Tomorrow
ar: غدا
id: Besok
ja: 明日
th: พรุ่งนี้
vi: Ngày mai

source: Next Week
ar: الاسبوع المقبل
id: Minggu depan
ja: 来週
th: สัปดาห์หน้า
vi: Tuần tới

source: Next Month
ar: الشهر القادم
id: Bulan depan
ja: 来月
th: เดือนหน้า
vi: Tháng tiếp theo

source: Next Year
ar: العام القادم
id: Tahun depan
ja: 来年
th: ปีหน้า
vi: Năm sau

source: 1 Hour ago
ar: منذ 1 ساعة
id: 1 Jam yang lalu
ja: 1時間前
th: 1 ชั่วโมงที่แล้ว
vi: 1 tiếng trước

source: Yesterday
ar: أمس
id: Kemarin
ja: 昨日
th: เมื่อวานนี้
vi: Hôm qua

source: Last Week
ar: الاسبوع الماضى
id: Minggu lalu
ja: 先週
th: อาทิตย์ที่แล้ว
vi: Tuần trước

source: Last Month
ar: الشهر الماضي
id: Bulan lalu
ja: 先月
th: เดือนที่แล้ว
vi: Tháng trước

source: A Year Ago
ar: قبل عام
id: Tahun lalu
ja: 一年前
th: เมื่อปีก่อน
vi: Một năm trước

source: Export Schema
ar: مخطط التصدير
id: Skema Ekspor
ja: 導出架構
th: สคีมาการส่งออก
vi: Lược đồ xuất khẩu

source: Import Schema
ar: مخطط الاستيراد
id: Skema Impor
ja: 導入架構
th: นำเข้าสคีมา
vi: Nhập giản đồ

source: Get
ar: احصل على
id: Mendapatkan
ja: 得到
th: รับ
vi: Hiểu được

source: Import from Connekthub
ar: الاستيراد من Connekthub
id: Impor dari Connecthub
ja: 從 Connekthub 導入
th: นำเข้าจาก Connekthub
vi: Nhập từ Connekthub

source: New Condition
ar: شرط جديد
id: Kondisi baru
ja: 新規条件
th: เงื่อนไขใหม่
vi: điều kiện mới

source: Submit
ar: يقدم
id: Kirim
ja: 送信
th: ส่ง
vi: Nộp

source: Condition
ar: شرط
id: Kondisi
ja: 状態
th: สภาพ
vi: Tình trạng

source: Field1
ar: مجال 1
id: bidang1
ja: フィールド1

source: Field2
ar: مجال 2
id: bidang2
ja: フィールド2

# nounModifier
source: Noun modifier separator
ar: فاصل معدل الاسم
id: Pemisah pengubah kata benda
ja: 名詞修飾子セパレータ
th: ตัวคั่นคำนามตัวแยก
vi: Dấu phân tách bổ ngữ danh từ

# shortDescription
source: Short description separator
ar: فاصل وصف قصير
id: pemisah deskripsi singkat
ja: 簡単な説明の区切り文字
th: ตัวคั่นคำอธิบายสั้น ๆ
vi: Dấu phân tách mô tả ngắn

# longDescription
source: Long description separator
ar: فاصل الوصف الطويل
id: Pemisah deskripsi panjang
ja: 長い説明の区切り文字
th: ตัวคั่นคำอธิบายแบบยาว
vi: Dấu phân tách mô tả dài

source: Long description format
ar: وصف مطول شكل
id: Format deskripsi panjang
ja: 長い説明形式
th: รูปแบบคำอธิบายแบบยาว
vi: Định dạng mô tả dài

# attributeSep
source: Attribute separator
ar: فاصل السمات
id: Pemisah atribut
ja: 属性セパレータ
th: ตัวคั่นแอตทริบิวต์
vi: Dấu phân tách thuộc tính

# attributeFormat
source: Attibute format for long description
ar: تنسيق السمة لوصف طويل
id: Format atribut untuk deskripsi panjang
ja: 長い説明のためのAttibuteフォーマット
th: รูปแบบแอตทริบิวต์สำหรับคำอธิบายแบบยาว
vi: Định dạng Attibute cho mô tả dài

# shortDescActive
source: Short description active
ar: تم تفعيل الوصف المختصر
id: Deskripsi singkat aktif
ja: 簡単な説明がアクティブ
th: คำอธิบายสั้น ๆ ใช้งานอยู่
vi: Mô tả ngắn đang hoạt động

# longDescActive
source: Long description active
ar: الوصف الطويل نشط
id: Deskripsi panjang aktif
ja: 長い説明がアクティブ
th: คำอธิบายแบบยาวเปิดใช้งานอยู่
vi: Mô tả dài đang hoạt động

# manualDescription
source: Allow users to maintain descriptions manually
ar: السماح للمستخدمين بالاحتفاظ بالأوصاف يدويًا
id: Izinkan pengguna untuk mempertahankan deskripsi secara manual
ja: ユーザーが説明を手動で管理できるようにする
th: อนุญาตให้ผู้ใช้รักษาคำอธิบายด้วยตนเอง
vi: Cho phép người dùng duy trì mô tả theo cách thủ công

# transferClassification
source: Transfer to classification
ar: التحويل إلى التصنيف
id: Transfer ke klasifikasi
ja: 分類に転送
th: โอนไปยังการจัดประเภท
vi: Chuyển sang phân loại

source: Rule Settings
ar: إعدادات القاعدة
id: Pengaturan Aturan
ja: ルール設定
th: การตั้งค่ากฎ
vi: Cài đặt quy tắc

# shortDescription
source: Short Description field
ar: حقل الوصف المختصر
id: pemisah deskripsi singkat
ja: 簡単な説明の区切り文字
th: ตัวคั่นคำอธิบายสั้น ๆ
vi: Dấu phân tách mô tả ngắn

# longDescription
source: Long Description field
ar: حقل الوصف الطويل
id: Pemisah deskripsi panjang
ja: 長い説明の区切り文字
th: ตัวคั่นคำอธิบายแบบยาว
vi: Dấu phân tách mô tả dài

# proposeNoun
source: Field for system to analyze and propose noun
ar: مجال لنظام لتحليل واقتراح الاسم
id: Bidang untuk sistem untuk menganalisis dan mengusulkan kata benda
ja: 名詞を分析して提案するシステムのフィールド
th: สนามสำหรับระบบวิเคราะห์และเสนอคำนาม
vi: Trường để hệ thống phân tích và đề xuất danh từ

# descSettings
source: Field for defining description settings
ar: حقل لتعريف إعدادات الوصف
id: Bidang untuk menentukan pengaturan deskripsi
ja: C説明設定を定義するためのフィールド
th: ฟิลด์สำหรับกำหนดการตั้งค่าคำอธิบาย
vi: Trường xác định cài đặt mô tả

source: Store data in
ar: تخزين البيانات بتنسيق
id: Simpan data di
ja: にデータを保存する
th: จัดเก็บข้อมูลใน
vi: Lưu trữ dữ liệu trong

source: Account
ar: حساب
id: Akun
ja: アカウント
th: บัญชี
vi: Tài khoản

source: New Dataset fields
ar: حقول مجموعة بيانات جديدة
id: Bidang Dataset baru
ja: 新しいデータセットフィールド
th: ฟิลด์ชุดข้อมูลใหม่
vi: Các trường Tập dữ liệu mới

source: Organization Logo
ar: شعار المنظمة
id: Logo Organisasi
ja: 組織のロゴ
th: โลโก้องค์กร
vi: Biểu trưng của tổ chức

source: Organization Name
ar: اسم المنظمة
id: Nama Organisasi
ja: 組織名
th: ชื่อองค์กร
vi: tên tổ chức

# organization-website
source: Website
ar: موقع إلكتروني
id: Situs web
ja: Webサイト
th: เว็บไซต์
vi: Trang mạng

# organization-billing-email
source: Billing E-mail
ar: البريد الالكتروني لقوائم الدفع
id: Email Penagihan
ja: 請求メール
th: อีเมลเรียกเก็บเงิน
vi: Thanh toán bằng thư điện tử

# organization-contact-number
source: Contact Number
ar: رقم الاتصال
id: Nomor kontak
ja: 連絡先番号
th: เบอร์ติดต่อ
vi: Số liên lạc

# organization-user-count
source: Number of Users
ar: عدد المستخدمين
id: Jumlah Pengguna
ja: 利用者数
th: จำนวนผู้ใช้
vi: Số lượng người dùng

# organization-address-details
source: Address Details
ar: تفاصيل العنوان
id: Alamat Lengkap
ja: 住所の詳細
th: รายละเอียดที่อยู่
vi: Chi tiết địa chỉ

# organization-address-search-placeholder
source: Start typing here to search
ar: ابدأ الكتابة هنا للبحث
id: Mulai mengetik di sini untuk mencari
ja: ここに入力して検索します
th: เริ่มพิมพ์ที่นี่เพื่อค้นหา
vi: Bắt đầu nhập vào đây để tìm kiếm

# organization-street-number
source: Street Number
ar: رقم الشارع
id: Nomor jalan
ja: 街路番号
th: หมายเลขถนน
vi: Số đường

# organization-address-line-1
source: Address Line 1
ar: العنوان السطر 1
id: Baris Alamat 1
ja: 住所1
th: ที่อยู่บรรทัดที่ 1
vi: Dòng địa chỉ 1

# organization-address-line-2
source: Address Line 2
ar: سطر العنوان 2
id: Alamat Baris 2
ja: 住所2
th: ที่อยู่บรรทัดที่ 2
vi: Địa chỉ 2

# organization-suburb
source: Suburb/Town/City
ar: الضاحية / البلدة / المدينة
id: Pinggiran Kota/Kota/Kota
ja: 郊外/町/市
th: ชานเมือง/เมือง/เมือง
vi: Ngoại ô / Thị trấn / Thành phố

# organization-state
source: State
ar: ولاية
id: Negara
ja: 州
th: สถานะ
vi: Trạng thái

# organization-country
source: Country
ar: دولة
id: Negara
ja: 国
th: ประเทศ
vi: Quốc gia

# organization-postal-code
source: Postcode
ar: الرمز البريدي
id: Kode Pos
ja: 郵便番号
th: รหัสไปรษณีย์
vi: Mã bưu điện

# organization-details-fetch-error-toast
source: Something happened! Cannot retrieve organization details.
ar: شيء ما حصل! لا يمكن استرداد تفاصيل المؤسسة.
id: Sesuatu telah terjadi! Tidak dapat mengambil detail organisasi.
ja: 何かあった！ 組織の詳細を取得できません。
th: มีบางอย่างเกิดขึ้น! ไม่สามารถเรียกรายละเอียดองค์กร
vi: Một cái gì đó đã xảy ra! Không thể truy xuất chi tiết tổ chức.

# organization-details-update-success-toast
source: Organization details updated!
ar: تم تحديث تفاصيل المنظمة!
id: Detail organisasi diperbarui!
ja: 組織の詳細が更新されました！
th: อัพเดทรายละเอียดองค์กรแล้ว!
vi: Đã cập nhật thông tin chi tiết về tổ chức!

# organization-details-update-error-toast
source: Something happened! Cannot update organization details
ar: شيء ما حصل! لا يمكن تحديث تفاصيل المنظمة
id: Sesuatu telah terjadi! Tidak dapat memperbarui detail organisasi
ja: 何かあった！ 組織の詳細を更新できません
th: มีบางอย่างเกิดขึ้น! ไม่สามารถอัปเดตรายละเอียดองค์กร
vi: Một cái gì đó đã xảy ra! Không thể cập nhật chi tiết tổ chức

# usage-data-storage-title
source: Data Storage
ar: مخزن البيانات
id: Penyimpanan data
ja: データストレージ
th: การจัดเก็บข้อมูล
vi: Lưu trữ dữ liệu

# usage-user-roles-title
source: User Roles
ar: أدوار المستخدمين
id: Peran Pengguna
ja: ユーザーの役割
th: บทบาทของผู้ใช้
vi: Vai trò người dùng

# usage-role-name-column-header
source: Role Name
ar: اسم الدور
id: Nama peran
ja: 役割名
th: ชื่อบทบาท
vi: Tên vai trò

# usage-role-count-column-header
source: Number of Users
ar: عدد المستخدمين
id: Jumlah Pengguna
ja: 利用者数
th: จำนวนผู้ใช้
vi: Số lượng người dùng

# usage-dataset-sizes-title
source: Dataset Sizes
ar: أحجام مجموعة البيانات
id: Ukuran kumpulan data
ja: データセットのサイズ
th: จำนวนผู้ใช้
vi: Kích thước tập dữ liệu

# usage-dataset-name-column-header
source: Dataset Name
ar: اسم مجموعة البيانات
id: Nama Kumpulan Data
ja: データセット名
th: ชื่อชุดข้อมูล
vi: Tên tập dữ liệu

# usage-dataset-size-column-header
source: Size
ar: بحجم
id: Ukuran
ja: サイズ
th: ขนาด
vi: Kích cỡ

# usage-data-pie-title
source: Data Usage
ar: استخدام البيانات
id: Penggunaan data
ja: データ使用量
th: การใช้ข้อมูล
vi: Sử dụng dữ liệu

# usage-business-rules-title
source: Business Rules
ar: قواعد الاعمال
id: Peraturan bisnis
ja: ビジネスルール
th: กฎเกณฑ์ทางธุรกิจ
vi: Quy tắc kinh doanh

# usage-business-rule-name-column-header
source: Business Rule Name
ar: اسم قاعدة العمل
id: Nama Aturan Bisnis
ja: ビジネスルール名
th: ชื่อกฎธุรกิจ
vi: Tên quy tắc kinh doanh

# usage-business-rule-dataset-name-column-header
source: Dataset Name
ar: اسم مجموعة البيانات
id: Nama Kumpulan Data
ja: データセット名
th: ชื่อชุดข้อมูล
vi: Tên tập dữ liệu

# usage-business-rule-run-count-column-header
source: Run Count
ar: تشغيل العد
id: Jalankan Hitungan
ja: 実行カウント
vi: Lượt chạy

source: min(s) ago
ar: دقائق مضت
id: beberapa menit yang lalu
ja: 数分前
th: เมื่อไม่กี่นาทีที่ผ่านมา
vi: Vài phút trước

# hrs_ago
source: hour(s) ago
ar: منذ ساعات
id: beberapa jam yang lalu
ja: 時間前
th: ชั่วโมงที่ผ่านมา
vi: nhiều giờ trước

source: day(s) ago
ar: أيام مضت
id: beberapa hari yang lalu
ja: 数日前
th: วันที่ผ่านมา
vi: ngày trước

source: week(s) ago
ar: منذ أسابيع
id: minggu yang lalu
ja: 何週間前
th: หลายสัปดาห์ที่แล้ว
vi: vài tuần trước

source: month(s) ago
ar: منذ أشهر
id: bulan lalu
ja: 数か月前
th: หลายเดือนก่อน
vi: vài tháng trước

source: year(s) ago
ar: سنين مضت
id: bertahun-tahun lalu
ja: 数年前
th: เมื่อหลายปีก่อน
vi: năm trước

# in_mins
source: In {in_mins_val} min(s)
ar: دقائق {in_mins_val} في
id: Dalam {in_mins_val} menit
ja: {in_mins_val}分で
th: ใน {in_mins_val} นาที
vi: Trong {in_mins_val} phút

# in_hrs
source: In {in_hrs_val} hour(s)
ar: ساعات {in_hrs_val} في
id: Dalam {in_hrs_val} jam
ja: {in_hrs_val}時間で
th: ใน {in_hrs_val} ชั่วโมง
vi: Trong {in_hrs_val} giờ

# in_days
source: In {in_days_val} day(s)
ar: أيام {in_days_val} في
id: Dalam {in_days_val} hari
ja: {in_days_val}日後
th: ใน {in_days_val} วัน
vi: Trong {in_days_val} ngày

# in_weeks
source: In {in_weeks_val} week(s)
ar: أسابيع {in_weeks_val} في
id: Dalam {in_weeks_val} minggu
ja: {in_weeks_val}週間で
th: ใน {in_weeks_val} สัปดาห์
vi: Trong {in_weeks_val} tuần

# in_months
source: In {in_months_val} month(s)
ar: أشهر {in_months_val} في
id: Dalam {in_months_val} bulan
ja: {in_months_val}ヶ月で
th: ใน {in_months_val} เดือน
vi: Trong {in_months_val} tháng

# in_years
source: In {in_years_val} year(s)
ar: سنوات {in_years_val} في
id: Dalam {in_years_val} tahun
ja: {in_years_val}年後
th: ใน {in_years_val} ปี
vi: Trong {in_years_val} năm

source: Export template
ar: قالب التصدير
id: Ekspor template
ja: テンプレートをエクスポートします
th: ส่งออกเทมเพลต
vi: Mẫu xuất

# dimensions_uom
source: Dimensions
ar: أبعاد
id: Ukuran
ja: 寸法
th: ขนาด
vi: Kích thước

source: Dimensions and UoM Mapping
ar: الأبعاد ورسم خرائط وحدات القياس
id: Dimensi dan Pemetaan UoM
ja: 寸法とUoMマッピング
th: ขนาดและการทำแผนที่ UoM
vi: Thứ nguyên và ánh xạ UoM

source: Add dimension
ar: أضف البعد
id: Tambahkan dimensi
ja: ディメンションを追加
th: เพิ่มมิติ
vi: Thêm thứ nguyên

source: Class name
ar: اسم الفصل
id: Nama kelas
ja: クラス名
th: ชื่อคลาส
vi: Tên lớp

# int_mapping
source: Mapping
ar: رسم الخرائط
id: Pemetaan
ja: マッピング
th: การทำแผนที่
vi: Lập bản đồ

# allow_maintaining_new_value
source: Allow maintaining new values
ar: السماح بالحفاظ على القيم الجديدة
id: Izinkan mempertahankan nilai-nilai baru
ja: 新しい値を維持できるようにする
th: อนุญาตให้รักษาค่าใหม่
vi: Cho phép duy trì các giá trị mới

# required_characteristics
source: Required characteristic
ar: الخاصية المطلوبة
id: Karakteristik yang diperlukan
ja: 必要な特性
th: ลักษณะที่ต้องการ
vi: Đặc điểm yêu cầu

source: Add language
ar: إضافة لغة
id: Tambahkan bahasa
ja: 言語を追加する
th: เพิ่มภาษา
vi: Thêm ngôn ngữ

source: Edit characteristics
ar: تحرير الخصائص
id: Edit karakteristik
ja: 特性を編集する
th: แก้ไขลักษณะ
vi: Chỉnh sửa đặc điểm

# modifier_short_description
source: Modifier to be part of short description
ar: أن يكون المُعدِّل جزءًا من وصف موجز
id: Pengubah menjadi bagian dari deskripsi singkat
ja: 簡単な説明の一部となる修飾子
th: ตัวดัดแปลงเพื่อเป็นส่วนหนึ่งของคำอธิบายสั้น ๆ
vi: Bổ ngữ là một phần của mô tả ngắn

# noun_short_description
source: Noun to be part of short description
ar: اسم ليكون جزءًا من وصف موجز
id: Kata benda untuk menjadi bagian dari deskripsi singkat
ja: 簡単な説明の一部となる名詞
th: คำนามที่จะเป็นส่วนหนึ่งของคำอธิบายสั้น ๆ
vi: Danh từ trở thành một phần của mô tả ngắn

# description_generation
source: Enable for description generation
ar: تفعيل لتوليد الوصف
id: Aktifkan untuk pembuatan deskripsi
ja: 説明の生成を有効にする
th: เปิดใช้งานสำหรับการสร้างคำอธิบาย
vi: Cho phép tạo mô tả

source: Inherit characteristics
ar: ترث الخصائص
id: Mewarisi karakteristik
ja: 特性を継承する
th: สืบทอดลักษณะ
vi: Đặc điểm kế thừa

source: to upload
ar: للتحميل
id: untuk mengunggah
ja: アップロードする
th: ที่จะอัปโหลด
vi: tải lên

source: Check code
ar: التحقق من الشفرة
id: Periksa kode
ja: コードを確認してください
th: ตรวจสอบรหัส
vi: Kiểm tra mã

source: browse
ar: تصفح
id: jelajahi
ja: ブラウズ
th: เรียกดู
vi: duyệt qua

source: Drag files here or
ar: اسحب الملفات هنا أو
ja: ここにファイルをドラッグするか、
th: ลากไฟล์มาที่นี่หรือ
vi: Kéo tệp vào đây hoặc

# new_language_characteristics
source: Add language-characteristics
ar: أضف خصائص اللغة
id: Tambahkan karakteristik bahasa
ja: 言語特性を追加する
th: เพิ่มภาษา-ลักษณะ
vi: Thêm đặc điểm ngôn ngữ

source: Establishing connection...
ar: اجراء اتصال...
id: Membuat koneksi...
ja: 接続を確立しています...
th: กำลังสร้างการเชื่อมต่อ...
vi: Đang thiết lập kết nối ...

source: Publish
ar: ينشر
ja: 公開
th: เผยแพร่
vi: Công bố

source: Add rule
ar: أضف القاعدة
id: Tambahkan aturan
ja: ルールを追加
th: เพิ่มกฎ
vi: Thêm quy tắc

source: Sync frequency
ar: تردد المزامنة
id: Frekuensi sinkronisasi
ja: 同期周波数
th: ความถี่ในการซิงค์
vi: Đồng bộ hóa tần số

source: Frequency
ar: تكرر
id: Frekuensi
ja: 周波数
th: ความถี่
vi: Tính thường xuyên

source: Repeat by
ar: كرر بواسطة
id: Ulangi oleh
ja: で繰り返す
th: ทำซ้ำโดย
vi: Lặp lại bởi

source: Ends
ar: ينتهي
id: Berakhir
ja: 終了
th: สิ้นสุด
vi: Kết thúc

source: Repeat
ar: يكرر
id: mengulang
ja: 繰り返す
th: ทำซ้ำ
vi: Nói lại

source: Material type
ar: نوع المادة
id: Jenis bahan
ja: 材料の種類
th: ประเภทวัสดุ
vi: Loại vật liệu

source: Target system
ar: النظام المستهدف
id: Sistem sasaran
ja: ターゲットシステム
th: ระบบเป้าหมาย
vi: Hệ thống mục tiêu

# discart
source: Discard
ar: تجاهل
id: Membuang
ja: 破棄
th: ทิ้ง
vi: Bỏ đi

source: Systems
ar: الأنظمة
id: Sistem
ja: システム
th: ระบบ
vi: Hệ thống

source: Enable sync
ar: تمكين المزامنة
id: Aktifkan sinkronisasi
ja: 同期を有効にする
th: เปิดใช้งานการซิงค์
vi: Bật đồng bộ hóa

# allow_multiple_classifications
source: Allows multiple classifications
ar: يسمح بالتصنيفات المتعددة
id: Memungkinkan beberapa klasifikasi
ja: 複数の分類を許可します
th: อนุญาตการจำแนกหลายประเภท
vi: Cho phép nhiều phân loại

source: Related datasets
ar: مجموعات البيانات ذات الصلة
id: Kumpulan data terkait
ja: 関連するデータセット
th: ชุดข้อมูลที่เกี่ยวข้อง
vi: Bộ dữ liệu liên quan

source: New class type
ar: نوع فئة جديد
id: Jenis kelas baru
ja: 新しいクラスタイプ
th: คลาสใหม่
vi: Loại lớp mới

source: Remove
ar: إزالة
id: Menghapus
ja: 削除
th: ลบ
vi: Tẩy
