Repository: Fardim/sample-code-2022
Catalog: src/locale/messages.*.xlf
Languages: ar, id, ja, th, vi

# duplicate_language
source: Language already selected! please select another language
ar: اللغة المختارة بالفعل! الرجاء تحديد لغة أخرى
id: Bahasa sudah dipilih! silahkan pilih bahasa lain
ja: 言語はすでに選択されています！ 別の言語を選択してください
th: เลือกภาษาแล้ว! โปรดเลือกภาษาอื่น
vi: Ngôn ngữ đã được chọn! vui lòng chọn một ngôn ngữ khác

source: New row
ar: صف جديد
id: Baris baru
ja: 新しい行
th: แถวใหม่
vi: Hàng mới

source: At least one role should be selected
ar: يجب اختيار دور واحد على الأقل
id: Setidaknya satu peran harus dipilih
ja: 少なくとも1つの役割を選択する必要があります
th: ควรเลือกอย่างน้อยหนึ่งบทบาท
vi: Ít nhất một vai trò nên được chọn

source: Characteristics - Expansion view
ar: الخصائص - عرض التوسع
id: Karakteristik - Tampilan ekspansi
ja: 特徴-拡大図
th: ลักษณะ - มุมมองขยาย
vi: Đặc điểm - Chế độ xem mở rộng

# allow_maintaining_value_range
source: Allows maintaining value range
ar: يسمح بالحفاظ على نطاق القيمة
id: Memungkinkan mempertahankan rentang nilai
ja: 値の範囲を維持できます
th: ช่วยให้รักษาช่วงค่า
vi: Cho phép duy trì phạm vi giá trị

source: New Language
ar: لغة جديدة
id: Bahasa baru
ja: 新しい言語
th: ภาษาใหม่
vi: Ngôn ngữ mới

source: Duplicate
ar: ينسخ
id: Duplikat
ja: 複製
th: ทำซ้ำ
vi: Bản sao

source: New characteristics
ar: خصائص جديدة
id: Karakteristik baru
ja: 新しい特徴
th: ลักษณะใหม่
vi: Đặc điểm mới

# modShort
source: Decimal places
ar: منازل عشرية
id: Tempat desimal
ja: 小数位
th: ตำแหน่งทศนิยม
vi: Vị trí thập phân

source: Publish to Library
ar: انشر في المكتبة
id: Publikasikan ke Perpustakaan
ja: ライブラリに公開
th: เผยแพร่ไปยังห้องสมุด
vi: Xuất bản lên Thư viện

# invalid_sla
source: Please select only one workflow path for stepwise SLA reporting
ar: الرجاء تحديد مسار سير عمل واحد فقط لتقارير SLA التدريجية
id: Harap pilih hanya satu jalur alur kerja untuk pelaporan SLA bertahap
ja: 段階的なSLAレポートのワークフローパスを1つだけ選択してください
th: โปรดเลือกเส้นทางเวิร์กโฟลว์เพียงเส้นทางเดียวสำหรับการรายงาน SLA แบบเป็นขั้นตอน
vi: Vui lòng chỉ chọn một đường dẫn quy trình làm việc cho báo cáo SLA từng bước

source: Report type
ar: نوع التقرير
id: Tipe laporan
ja: レポートタイプ
th: ประเภทรายงาน
vi: Loại báo cáo

# dataset_madatory
source: Dataset selection is mandatory
ar: اختيار مجموعة البيانات إلزامي
id: Pemilihan kumpulan data adalah wajib
ja: データセットの選択は必須です
th: จำเป็นต้องเลือกชุดข้อมูล
vi: Lựa chọn tập dữ liệu là bắt buộc

source: Switch period view
ar: تبديل عرض الفترة
id: Beralih tampilan periode
ja: 期間ビューの切り替え
th: เปลี่ยนมุมมองช่วงเวลา
vi: Chuyển đổi chế độ xem thời gian

source: Revert
ar: يرجع
id: Kembali
ja: 元に戻す
th: ย้อนกลับ
vi: Hoàn nguyên

# export
source: Export schema configuration
ar: تكوين مخطط التصدير
id: Ekspor konfigurasi skema
ja: スキーマ構成のエクスポート
th: ส่งออกการกำหนดค่าสคีมา
vi: Xuất cấu hình giản đồ

source: Display
ar: عرض
id: Menampilkan
ja: 画面
th: แสดง
vi: Trưng bày

source: Authorise
ar: تفويض
id: Mengizinkan
ja: 承認する
th: อนุญาต
vi: Ủy quyền

source: Date modified
ar: التاريخ عدل
id: Tanggal diubah
ja: 日付が変更されました
th: วันที่แก้ไข
vi: Ngày sửa đổi

source: Date created
ar: تاريخ الإنشاء
id: Tanggal Diciptakan
ja: 作成日
th: วันที่สร้าง
vi: Ngày tạo

source: Standard package
ar: الحزمة القياسية
id: Paket standar
ja: 標準パッケージ
th: แพ็คเกจมาตรฐาน
vi: Gói tiêu chuẩn

source: Service structure
ar: هيكل الخدمة
id: Struktur layanan
ja: サービス構造
th: โครงสร้างการให้บริการ
vi: Cơ cấu dịch vụ

source: Superior grid
ar: شبكة متفوقة
id: jaringan unggul
ja: 優れたグリッド
th: ตะแกรงที่เหนือกว่า
vi: Lưới cao cấp

source: Structure type
ar: نوع الهيكل
id: Jenis struktur
ja: 構造タイプ
th: ประเภทโครงสร้าง
vi: Loại cấu trúc

source: Superior structure
ar: هيكل متفوق
id: Struktur unggul
ja: 優れた構造
th: โครงสร้างที่เหนือกว่า
vi: Cấu trúc cao cấp

source: Structure level config
ar: تكوين مستوى الهيكل
id: Konfigurasi tingkat struktur
ja: 構造レベルの構成
th: การกำหนดค่าระดับโครงสร้าง
vi: Cấu hình mức cấu trúc

source: SAP table
ar: جدول SAP
id: tabel SAP
ja: SAPテーブル
th: ตาราง SAP
vi: Bảng SAP

source: Record number
ar: رقم قياسي
id: Catatan nomor
ja: レコード番号
th: บันทึกหมายเลข
vi: Con số kỷ lục

source: New dimension
ar: بعدا جديدا
id: Dimensi baru
ja: 新しい次元
th: มิติใหม่
vi: Chiều hướng mới

source: Image
ar: صورة
id: Gambar
ja: 画像
th: ภาพ
vi: Hình ảnh

source: Colloquial name
ar: الاسم العامي
ja: 口語名
th: ชื่อภาษาพูด
vi: Tên thông tục

source: Export template
ar: قالب التصدير
id: Ekspor template
ja: テンプレートをエクスポートします
th: ส่งออกเทมเพลต
vi: Mẫu xuất

source: Discard
ar: تجاهل
id: Membuang
ja: 破棄
th: ทิ้ง
vi: Bỏ đi

# inheritCharacteristics
source: SAP characteristics
ar: خصائص SAP
id: Karakteristik SAP
ja: SAPの特徴
th: ลักษณะ SAP

source: Forms
ar: نماذج
id: Formulir
ja: フォーム
th: แบบฟอร์ม
vi: Các hình thức

source: Flows
ar: يطفو
id: arus
ja: 流れ
th: กระแส
vi: Chảy

source: Copy
ar: ينسخ
id: Salinan
ja: コピー
th: สำเนา
vi: Sao chép

source: Edit
ar: يحرر
id: Sunting
ja: 編集
th: แก้ไข
vi: Biên tập

# roles_invalid
source: At least one role should be selected
ar: يجب اختيار دور واحد على الأقل
id: Setidaknya satu peran harus dipilih
ja: 少なくとも1つの役割を選択する必要があります
th: ควรเลือกอย่างน้อยหนึ่งบทบาท
vi: Ít nhất một vai trò nên được chọn

# interface_active
source: Active
ar: نشيط
id: نشيط
ja: نشيط
th: نشيط
vi: نشيط

source: Response
ar: إجابة
id: Tanggapan
ja: 応答
th: การตอบสนอง
vi: Phản ứng

source: Request
ar: طلب
id: Meminta
ja: リクエスト
th: ขอ
vi: Yêu cầu

# unitOfMeasure
source: Base unit of measure
ar: الوحده الأساسيه للقياس
id: Satuan ukuran dasar
ja: 基本測定単位
th: หน่วยฐานของการวัด
vi: Đơn vị chuẩn của đo lường

source: Material group
ar: مجموعة المواد
id: Kelompok bahan
ja: 材料グループ
th: กลุ่มวัสดุ
vi: Nhóm vật liệu

# user
source: Username
ar: اسم المستخدم
id: Nama belakang
ja: ユーザー名
th: ชื่อผู้ใช้
vi: tên tài khoản

source: Connection description
ar: وصف الاتصال
id: Deskripsi koneksi
ja: 接続の説明
th: คำอธิบายการเชื่อมต่อ
vi: Mô tả kết nối

source: New Rule
ar: قانون جديد
id: Aturan baru
ja: 新しいルール
th: กฎใหม่
vi: Quy tắc mới

source: Rule name
ar: اسم القاعدة
id: Nama aturan
ja: ルール名
th: ชื่อกฎ
vi: Tên quy tắc

source: Url
ar: عنوان Url

source: Sync data
ar: مزامنة البيانات
id: Sinkronkan data
ja: データを同期する
th: ซิงค์ข้อมูล
vi: Đồng bộ dữ liệu

# update_data_system
source: Update data in the system
ar: تحديث البيانات في النظام
id: Perbarui data dalam sistem
ja: システム内のデータを更新します
th: อัพเดทข้อมูลในระบบ
vi: Cập nhật dữ liệu trong hệ thống

source: Header structure
ar: هيكل الرأس
id: Struktur tajuk
ja: ヘッダー構造
th: โครงสร้างส่วนหัว
vi: Cấu trúc tiêu đề

# search_services
source: Search connectors
ar: موصلات البحث
id: Cari konektor
ja: コネクタの検索
th: ค้นหาตัวเชื่อมต่อ
vi: Trình kết nối tìm kiếm

# label
source: Type description
ar: اكتب الوصف
id: Ketik deskripsi
ja: タイプの説明
th: พิมพ์คำอธิบาย

# hostName
source: Hostname URL
ar: عنوان URL لاسم المضيف
id: URL nama host
ja: ホスト名のURL
th: URL ชื่อโฮสต์
vi: URL tên máy chủ

# delete_message
source: Are you sure to delete ?
ar: هل انت متأكد من الحذف ؟
id: Apakah Anda yakin untuk menghapus?
ja: 削除してもよろしいですか？
th: แน่ใจว่าจะลบ?
vi: Bạn có chắc chắn muốn xóa không ?

# last_modified_by
source: Modified By
ar: تم التعديل بواسطة
id: Dimodifikasi Oleh
ja: 変更された
th: ดัดแปลงโดย
vi: Được sửa đổi bởi

source: Select
ar: يختار
id: Pilih
ja: 選択する
vi: Lựa chọn

# form
source: Forms
ar: نماذج
id: Formulir
ja: フォーム
th: แบบฟอร์ม
vi: Các hình thức

source: Sync Enable
ar: تمكين المزامنة
id: Sinkronisasi Aktifkan
ja: 同期を有効にする
th: เปิดใช้งานการซิงค์
vi: Bật đồng bộ hóa

# widget_not_contain_special_char
source: Report name Cannot contain special characters
ar: لا يمكن أن يحتوي اسم التقرير على أحرف خاصة
id: Nama laporan Tidak boleh berisi karakter khusus
ja: 同期を有効にする
th: ชื่อรายงาน ต้องไม่มีอักขระพิเศษ
vi: Tên báo cáo Không được chứa các ký tự đặc biệt

# widgetname_mandatory
source: Report name is mandatory and cannot be empty.
ar: اسم التقرير إلزامي ولا يمكن أن يكون فارغًا.
id: Nama laporan wajib diisi dan tidak boleh kosong.
ja: レポート名は必須であり、空にすることはできません。
th: ชื่อรายงานเป็นข้อมูลบังคับและต้องไม่เว้นว่างไว้
vi: Tên báo cáo là bắt buộc và không được để trống.

# report_name_mandatory
source: Dashboard name is mandatory and cannot be empty.
ar: اسم لوحة المعلومات إلزامي ولا يمكن أن يكون فارغًا.
id: Nama dasbor wajib diisi dan tidak boleh kosong.
ja: ダッシュボード名は必須であり、空にすることはできません
vi: Tên trang tổng quan là bắt buộc và không được để trống.

# aggregation_mandatory
source: Aggregation operator is mandatory
ar: عامل التجميع إلزامي
id: Operator agregasi adalah wajib
ja: 集計演算子は必須です
th: ตัวดำเนินการรวมเป็นข้อบังคับ
vi: Toán tử tổng hợp là bắt buộc

source: SLA report
ar: تقرير جيش تحرير السودان
id: laporan SLA
ja: SLAレポート
vi: Báo cáo SLA

source: Time spent report
ar: تقرير الوقت المستغرق
id: Laporan waktu yang dihabiskan
ja: レポートに費やした時間
th: รายงานเวลาที่ใช้ไป
vi: Báo cáo thời gian đã sử dụng

source: 30 days
ar: 30 يوما
id: 30 hari
ja: 30日
vi: 30 ngày

source: 20 days
ar: 20 يوما
id: 20 hari
ja: 20日間
th: 20 วัน
vi: 20 ngày

source: 10 days
ar: 10 أيام
id: 10 hari
ja: 10日間
th: 10 วัน
vi: 10 ngày

source: 7 days
ar: 7 أيام
id: 7 hari
ja: 7日
th: 7 วัน
vi: 7 ngày

source: Switch period view
ar: تبديل عرض الفترة
id: Beralih tampilan periode
ja: 期間ビューの切り替え
th: เปลี่ยนมุมมองช่วงเวลา
vi: Chuyển đổi chế độ xem thời gian

# aging_validation
source: Please select a numeric type field or date type field under Aging/range calculation
ar: الرجاء تحديد حقل نوع رقمي أو حقل نوع التاريخ ضمن حساب العمر / النطاق
id: Silakan pilih bidang tipe numerik atau bidang tipe tanggal di bawah Perhitungan penuaan/rentang
ja: エージング/範囲計算で数値タイプフィールドまたは日付タイプフィールドを選択してください
th: โปรดเลือกฟิลด์ประเภทตัวเลขหรือฟิลด์ประเภทวันที่ภายใต้การคำนวณอายุ/ช่วง
vi: Vui lòng chọn trường loại số hoặc trường loại ngày trong tính toán Độ tuổi / phạm vi

# dashboard_not_have_special_char
source: Dashboard name Cannot contain special characters
ar: لا يمكن أن يحتوي اسم لوحة المعلومات على أحرف خاصة
id: Nama dasbor Tidak boleh berisi karakter khusus
ja: ダッシュボード名特殊文字を含めることはできません
th: ชื่อแดชบอร์ด ต้องไม่มีอักขระพิเศษ
vi: Tên trang tổng quan Không được chứa các ký tự đặc biệt

source: Table filters
ar: مرشحات الجدول
id: Filter tabel
ja: テーブルフィルター
th: ตัวกรองตาราง
vi: Bộ lọc bảng

source: Custom date
ar: تاريخ مخصص
id: Tanggal kustom
ja: カスタム日付
th: วันที่กำหนดเอง
vi: Ngày tùy chỉnh

source: Add rule
ar: أضف القاعدة
id: Tambahkan aturan
ja: ルールを追加
th: เพิ่มกฎ
vi: Thêm quy tắc

source: Publish dataset
ar: انشر مجموعة البيانات
id: Publikasikan kumpulan data
ja: データセットを公開する
th: เผยแพร่ชุดข้อมูล
vi: Xuất bản tập dữ liệu

source: Export dataset
ar: تصدير مجموعة البيانات
id: Ekspor kumpulan data
ja: データセットをエクスポートする
th: ส่งออกชุดข้อมูล
vi: Xuất tập dữ liệu

source: Last Modified
ar: آخر تعديل
id: Terakhir diubah
ja: 最終更新日
th: แก้ไขล่าสุด
vi: Sửa đổi lần cuối

# revoke_message
source: Are you sure to revoke ?
ar: هل أنت متأكد من الإلغاء؟
id: Apakah Anda yakin untuk mencabut?
ja: 取り消してもよろしいですか？
th: คุณแน่ใจหรือว่าจะเพิกถอน ?
vi: Bạn có chắc chắn thu hồi?

# resend_invitation_message
source: Are you sure to resend invitation ?
ar: هل أنت متأكد من إعادة إرسال الدعوة؟
id: Apakah Anda yakin akan mengirim ulang undangan?
ja: 招待状を再送してもよろしいですか？
th: คุณแน่ใจหรือว่าจะส่งคำเชิญอีกครั้ง
vi: Bạn có chắc chắn gửi lại lời mời không?

# deactivate_message
source: Are you sure to deactivate the member?
ar: هل أنت متأكد من إلغاء تنشيط العضو؟
id: Apakah Anda yakin untuk menonaktifkan anggota?
ja: メンバーを無効にしてよろしいですか？
th: คุณแน่ใจว่าจะปิดการใช้งานสมาชิก?
vi: Bạn có chắc chắn hủy kích hoạt thành viên không?

# activate_message
source: Are you sure to activate the member?
ar: هل أنت متأكد من تفعيل العضو؟
id: Apakah Anda yakin untuk mengaktifkan anggota?
ja: メンバーを有効にしてよろしいですか？
th: คุณแน่ใจที่จะเปิดใช้งานสมาชิกหรือไม่?
vi: Bạn có chắc chắn để kích hoạt thành viên?

source: Section state
ar: حالة القسم
id: Status bagian
ja: セクションの状態
th: สถานะมาตรา
vi: Trạng thái phần

source: Section properties
ar: خصائص القسم
id: Properti bagian
ja: セクションのプロパティ
th: คุณสมบัติมาตรา
vi: Thuộc tính phần

source: Form help
ar: شكل المساعدة
id: Bantuan formulir
ja: フォームヘルプ
th: แบบฟอร์มช่วยเหลือ
vi: Biểu mẫu trợ giúp

source: Form usage
ar: شكل المساعدة
id: Penggunaan formulir
ja: フォームの使用法
th: การใช้แบบฟอร์ม
vi: Sử dụng biểu mẫu

source: Form name
ar: اسم النموذج
id: Nama formulir
ja: フォーム名
th: ชื่อแบบฟอร์ม
vi: Tên biểu mẫu

source: Form components
ar: مكونات النموذج
id: Komponen bentuk
ja: フォームコンポーネント
th: ส่วนประกอบของแบบฟอร์ม

source: Labels
ar: تسميات
id: Label
ja: ラベル
th: ป้าย
vi: Nhãn

source: Where used
ar: حيث تستخدم
id: Di mana digunakan
ja: 使用場所
th: ใช้ที่ไหน
vi: Sử dụng ở đâu

source: Field help
ar: المساعدة الميدانية
id: Bantuan lapangan
ja: フィールドヘルプ
th: ความช่วยเหลือภาคสนาม
vi: Trợ giúp thực địa

source: Data referencing
ar: الرجوع إلى البيانات
id: Referensi data
ja: データ参照
th: ข้อมูลอ้างอิง
vi: Tham chiếu dữ liệu

source: Allowed decimal places
ar: المنازل العشرية المسموح بها
id: Tempat desimal yang diizinkan
ja: 小数点以下の桁数を許可
th: ตำแหน่งทศนิยมที่อนุญาต
vi: Vị trí thập phân được phép

source: Key field
ar: مفتاح المجال
id: Bidang kunci
ja: キーフィールド
th: คีย์ฟิลด์
vi: Lĩnh vực chính

source: Dependency
ar: الاعتماد
id: Ketergantungan
ja: 依存
th: การพึ่งพา
vi: Sự phụ thuộc

source: Dataset record status
ar: حالة سجل مجموعة البيانات
id: Status catatan kumpulan data
ja: データセットレコードのステータス
th: สถานะบันทึกชุดข้อมูล
vi: Trạng thái bản ghi tập dữ liệu

source: Dataset
ar: مجموعة البيانات
id: Himpunan data
ja: データセット
th: ชุดข้อมูล
vi: Tập dữ liệu

source: Dataset search fields
ar: حقول البحث في مجموعة البيانات
id: Bidang pencarian kumpulan data
ja: データセット検索フィールド
th: ช่องค้นหาชุดข้อมูล
vi: Các trường tìm kiếm tập dữ liệu

source: Past date
ar: التاريخ الماضي
id: Tanggal lalu
ja: 過去の日付
th: วันที่ผ่านไป
vi: Ngày trước

source: Future date
ar: نينرن
id: Tanggal mendatang
ja: 将来の日付
th: วันที่ในอนาคต
vi: Ngày trong tương lai

source: Section
ar: الجزء
id: Bagian
ja: セクション
th: ส่วน
vi: Tiết diện

source: Download template
ar: تحميل النموذج
id: Unduh template
ja: テンプレートをダウンロード
th: ดาวน์โหลดเทมเพลต
vi: Tải xuống mẫu

source: Import data
ar: بيانات الاستيراد
id: Impor data
ja: データのインポート
th: นำเข้าข้อมูล
vi: Nhập dữ liệu

source: Export data
ar: تصدير البيانات
id: Ekspor data
ja: データのエクスポート
th: ส่งออกข้อมูล
vi: Xuất dữ liệu

source: Add new
ar: اضف جديد
id: Tambah baru
ja: 新しく追加する
th: เพิ่มใหม่
vi: Thêm mới

source: Create new
ar: خلق جديد إبداع جديد
id: Membuat baru
ja: 新しく作る
th: สร้างใหม่
vi: Tạo mới

source: Join properties
ar: خصائص الانضمام
ja: プロパティを結合する
th: เข้าร่วมคุณสมบัติ
vi: Tham gia các thuộc tính

source: Join type
ar: نوع الانضمام
id: Jenis bergabung
ja: 参加タイプ
th: เข้าร่วมประเภท
vi: Tham gia loại

source: Properties
ar: الخصائص
id: Properti
ja: プロパティ
th: คุณสมบัติ
vi: Tính chất

source: Map fields
ar: حقول الخريطة
id: Bidang peta
ja: マップフィールド
th: ช่องแผนที่
vi: Các lĩnh vực bản đồ

source: Company details
ar: تفاصيل الشركة
ja: 会社の詳細
th: รายละเอียดบริษัท
vi: Chi tiết công ty

source: Default date
ar: التاريخ الافتراضي
id: Tanggal default
ja: デフォルトの日付
th: วันที่เริ่มต้น
vi: Ngày mặc định

source: New condition
ar: شرط جديد
id: Kondisi baru
ja: 新規条件
th: เงื่อนไขใหม่
vi: Điều kiện mới

source: Changed
ar: تغير
id: Berubah
ja: かわった
th: เปลี่ยน
vi: Đã thay đổi

source: Deleted
ar: تم الحذف
id: Dihapus
ja: 削除
th: ถูกลบ
vi: Đã xóa

source: New
ar: جديد
id: Baru
ja: 新しい
th: ใหม่
vi: Mới mẻ

source: CR conflict
ar: الصراع CR
id: konflik CR
ja: CRの競合
th: CR ขัดแย้ง
vi: Xung đột CR

source: Grid form view
ar: عرض نموذج الشبكة
ja: グリッドフォームビュー
th: มุมมองแบบฟอร์มกริด
vi: Dạng xem dạng lưới

source: Base
ar: يتمركز
id: Basis
ja: ベース
th: ฐาน
vi: Cơ sở

source: Base record
ar: السجل الأساسي
id: Catatan dasar
ja: ベースレコード
th: บันทึกฐาน
vi: Bản ghi cơ sở

source: Conflicts only
ar: النزاعات فقط
id: Konflik saja
ja: 競合のみ
th: ความขัดแย้งเท่านั้น
vi: Chỉ xung đột

source: Company ID
ar: هوية الشركة
id: identitas perusahaan
ja: 会社ID
th: รหัสบริษัท
vi: ID công ty

# idpEntityId
source: Entity ID
ar: معرف الكيان
id: ID Entitas
ja: エンティティID
th: รหัสเอนทิตี
vi: ID phap nhân

# idpEntityId
source: IDP Alias
ar: IDP الاسم المستعار
id: ID Entitas
ja: エンティティID
th: รหัสเอนทิตี
vi: ID phap nhân

source: Connectivity
ar: الاتصال
ja: 接続性
th: การเชื่อมต่อ
vi: Kết nối

# roles_permissions
source: Roles and Permissions
ar: الأدوار والتصاريح
id: Peran dan Izin
ja: 役割と権限
th: บทบาทและการอนุญาต
vi: Vai trò và Quyền

source: Team
ar: فريق
id: Tim
ja: チーム
th: ทีม
vi: Đội

source: Email Templates
ar: قوالب البريد الإلكتروني
ja: メールテンプレート
th: เทมเพลตอีเมล
vi: mẫu thư điện tử

source: Regex
id: ekspresi reguler
ja: 正規表現

source: Modifier long
id: Pengubah panjang
ja: 長い修飾子
th: ตัวแก้ไขยาว
vi: Bổ ngữ dài

source: Modifier short
id: Pengubah pendek
ja: 修飾子が短い
th: ตัวแก้ไขสั้น
vi: Bổ ngữ ngắn

source: Options limit
id: Batas pilihan
ja: オプション制限
th: ตัวเลือกจำกัด
vi: Giới hạn tùy chọn

# idpXmlUrl
source: IDP URL
id: URL IDP
vi: URL IDP
