Repository: Fardim/sample-code-2022
Catalog: src/locale/messages.*.xlf
Languages: ar, id, ja, th, vi

source: Preferred Name
ar: الاسم المفضل
id: Nama yang dipilih
ja: 好ましい名称
th: ชื่อที่ต้องการ
vi: Tên Preferred

source: Phone Number
ar: رقم الهاتف
id: Nomor telepon
ja: 電話番号
th: หมายเลขโทรศัพท์
vi: Số điện thoại

source: Primary Email Address
ar: عنوان البريد الإلكتروني الرئيسي
id: Alamat Email Primer
ja: プライマリメールアドレス
th: ที่อยู่อีเมลหลัก
vi: Địa chỉ email chính

source: Secondary Email Address
ar: عنوان البريد الإلكتروني الثانوي
id: Alamat Email sekunder
ja: 予備のメールアドレス
th: ที่อยู่อีเมลสำรอง
vi: Địa chỉ email phụ

source: Change Password
ar: تغيير كلمة المرور
id: Ganti kata sandi
ja: パスワードを変更する
th: เปลี่ยนรหัสผ่าน
vi: Đổi mật khẩu

source: Digital Signature
ar: توقيع إلكتروني
id: Tanda tangan digital
ja: デジタル署名
th: ลายเซ็นดิจิตอล
vi: Chữ ký số

source: OK
ar: نعم
id: baik
th: ตกลง
vi: đồng ý

source: Current password
ar: كلمة السر الحالية
id: Kata sandi saat ini
ja: 現在のパスワード
th: รหัสผ่านปัจจุบัน
vi: Mật khẩu hiện tại

source: New password
ar: كلمة السر الجديدة
id: Kata sandi baru
ja: 新しいパスワード
th: รหัสผ่านใหม่
vi: Mật khẩu mới

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة
id: Konfirmasi password baru
ja: 新しいパスワードを確認
th: ยืนยันรหัสผ่านใหม่
vi: Xác nhận mật khẩu mới

source: Text
ar: نص
id: Teks
ja: テキスト
th: ข้อความ
vi: Bản văn

source: Code
ar: شفرة
id: Kode
ja: コード
th: รหัส
vi: Mã

source: Code and Text
ar: كود ونص
id: Kode dan Teks
ja: コードとテキスト
th: รหัสและข้อความ
vi: Mã và Văn bản

source: View as...
ar: يبدو مثل...
id: Menampilkan sebagai...
ja: として表示...
th: ดูเป็น ...
vi: Xem dưới dạng ...

# access_token_tooltip
source: Please enter your spare part library access token. If you do not have access to our spare part library, please contact sales@prospecta.com for more information.
ar: الرجاء إدخال رمز الوصول إلى مكتبة قطع الغيار الخاصة بك. إذا لم يكن لديك حق الوصول إلى مكتبة قطع الغيار الخاصة بنا ، فيرجى الاتصال بـ sales@prospecta.com للحصول على مزيد من المعلومات.
id: Harap masukkan token akses perpustakaan suku cadang Anda. Jika Anda tidak memiliki akses ke perpustakaan suku cadang kami, silakan hubungi sales@prospecta.com untuk informasi lebih lanjut.
ja: スペアパーツライブラリアクセストークンを入力してください。スペアパーツライブラリにアクセスできない場合は、sales @ prospecta.comに詳細をお問い合わせください。
th: โปรดป้อนโทเค็นการเข้าถึงไลบรารีอะไหล่ของคุณ หากคุณไม่สามารถเข้าถึงคลังอะไหล่ของเราโปรดติดต่อ sales@prospecta.com สำหรับข้อมูลเพิ่มเติม
vi: Vui lòng nhập mã thông báo truy cập thư viện phụ tùng của bạn. Nếu bạn không có quyền truy cập vào thư viện phụ tùng của chúng tôi, vui lòng liên hệ với sales@prospecta.com để biết thêm thông tin.

source: Enter access token
ar: أدخل رمز الوصول
id: Masukkan token akses
ja: アクセストークンを入力してください
th: ป้อนโทเค็นการเข้าถึง
vi: Nhập mã thông báo truy cập

# access_token_msg
source: Please enter access token
ar: الرجاء إدخال رمز الوصول
id: Harap masukkan token akses
ja: アクセストークンを入力してください
th: โปรดป้อนโทเค็นการเข้าถึง
vi: Vui lòng nhập mã thông báo truy cập

# fields_missing_msg
source: Please select the fields
ar: الرجاء تحديد الحقول
id: Pilih bidang
ja: フィールドを選択してください
th: โปรดเลือกฟิลด์
vi: Vui lòng chọn các trường

source: Standard function
ar: وظيفة قياسية
id: Fungsi standar
ja: 標準機能
th: ฟังก์ชั่นมาตรฐาน
vi: Chức năng tiêu chuẩn

# standard_fn_missing
source: Please select the standard function
ar: الرجاء تحديد الوظيفة القياسية
id: Pilih fungsi standar
ja: 標準機能を選択してください
th: โปรดเลือกฟังก์ชันมาตรฐาน
vi: Vui lòng chọn chức năng tiêu chuẩn

source: Select field
ar: حدد المجال
id: Pilih bidang
ja: フィールドを選択
th: เลือกฟิลด์
vi: Chọn lĩnh vực

source: Select operator
ar: حدد المشغل
id: Pilih operator
ja: 演算子の選択
th: เลือกตัวดำเนินการ
vi: Chọn nhà điều hành

source: Comparison value
ar: قيمة المقارنة
id: Nilai perbandingan
ja: 比較値
th: ค่าเปรียบเทียบ
vi: Giá trị so sánh

source: start value
ar: قيمه البدايه
id: nilai awal
ja: 開始値
th: ค่าเริ่มต้น
vi: giá trị bắt đầu

source: end value
ar: القيمة النهائية
id: nilai akhir
ja: 最終値
th: ค่าสิ้นสุด
vi: giá trị cuối cùng

source: Add child rule
ar: أضف القاعدة الفرعية
id: Tambahkan aturan anak
ja: 子ルールを追加する
th: เพิ่มกฎลูก
vi: Thêm quy tắc con

source: Module name
ar: اسم وحدة
id: Nama modul
ja: モジュール名
th: ชื่อโมดูล
vi: Tên mô-đun

# module_name_required
source: Module name is required
ar: اسم الوحدة مطلوب
id: Nama modul wajib diisi
ja: モジュール名が必要です
th: ต้องระบุชื่อโมดูล
vi: Tên mô-đun là bắt buộc

source: Preview row
ar: صف المعاينة
id: Pratinjau baris
ja: プレビュー行
th: แสดงตัวอย่างแถว
vi: Xem trước hàng

source: Target field
ar: الحقل الهدف
id: Bidang target
ja: ターゲットフィールド
th: ฟิลด์เป้าหมาย
vi: Trường mục tiêu

# enter_value
source: Enter a value
ar: أدخل قيمة
id: Masukkan nilai
ja: 値を入力してください
th: ป้อนค่า
vi: Nhập một giá trị

# required_field_msg
source: This field is required
ar: هذه الخانة مطلوبه
id: Bagian ini diperlukan
ja: この項目は必須です
th: จำเป็นต้องกรอกข้อมูลในฟิลด์นี้
vi: Trường này là bắt buộc

# schema_name_required
source: Schema name is required
ar: اسم المخطط مطلوب
id: Nama skema harus diisi
ja: スキーマ名が必要です
th: ต้องระบุชื่อสคีมา
vi: Tên giản đồ là bắt buộc

# weightage_help_msg
source: Score assigned to a record upon successful validation of a business rule. For a schema total weightage of all the business rules must not exceed 100
ar: الدرجة المخصصة لسجل عند التحقق الناجح من قاعدة العمل. بالنسبة إلى الوزن الإجمالي للمخطط لجميع قواعد العمل ، يجب ألا يتجاوز 100
id: Skor ditetapkan ke catatan setelah validasi aturan bisnis yang berhasil. Untuk skema, bobot total semua aturan bisnis tidak boleh melebihi 100
ja: ビジネスルールの検証が成功すると、レコードに割り当てられるスコア。スキーマの場合、すべてのビジネスルールの合計の重みは100を超えてはなりません
th: คะแนนที่กำหนดให้กับบันทึกเมื่อตรวจสอบความถูกต้องของกฎทางธุรกิจได้สำเร็จ สำหรับน้ำหนักรวมสคีมาของกฎทางธุรกิจทั้งหมดต้องไม่เกิน 100
vi: Điểm được chỉ định cho một bản ghi sau khi xác thực thành công quy tắc kinh doanh. Đối với một giản đồ, tổng trọng số của tất cả các quy tắc nghiệp vụ không được vượt quá 100

# no_br_added_msg
source: No business rule added, please add at least one business rule to continue
ar: لم تتم إضافة أي قاعدة عمل ، يرجى إضافة قاعدة عمل واحدة على الأقل للمتابعة
id: Tidak ada aturan bisnis yang ditambahkan, harap tambahkan setidaknya satu aturan bisnis untuk melanjutkan
ja: ビジネスルールが追加されていません。続行するには、少なくとも1つのビジネスルールを追加してください
th: ไม่ได้เพิ่มกฎทางธุรกิจโปรดเพิ่มกฎทางธุรกิจอย่างน้อยหนึ่งข้อเพื่อดำเนินการต่อ
vi: Không có quy tắc kinh doanh nào được thêm vào, vui lòng thêm ít nhất một quy tắc kinh doanh để tiếp tục

# add_br_rule
source: Add Business Rule
ar: أضف قاعدة العمل
id: Tambahkan aturan bisnis baru
ja: ビジネスルールを追加する
th: เพิ่มกฎทางธุรกิจ
vi: Thêm quy tắc kinh doanh

source: Not configured
ar: غير مهيأ
id: Tidak dikonfigurasi
ja: 構成されていません
th: ไม่ได้กำหนดค่า
vi: Không được định cấu hình

source: Configure
ar: تهيئة
id: Konfigurasi
ja: 構成、設定
th: กำหนดค่า
vi: Định cấu hình

source: Select subscribers
ar: حدد المشتركين
id: Pilih pelanggan
ja: サブスクライバーを選択します
th: เลือกสมาชิก
vi: Chọn người đăng ký

# no_subscribers_msg
source: No subscribers added, please add at least one subscriber to continue
ar: لم تتم إضافة أي مشتركين ، يرجى إضافة مشترك واحد على الأقل للمتابعة
id: Tidak ada pelanggan yang ditambahkan, harap tambahkan setidaknya satu pelanggan untuk melanjutkan
ja: サブスクライバーは追加されていません。続行するには、少なくとも1つのサブスクライバーを追加してください
th: ไม่มีการเพิ่มสมาชิกโปรดเพิ่มสมาชิกอย่างน้อยหนึ่งคนเพื่อดำเนินการต่อ
vi: Không có người đăng ký nào được thêm, vui lòng thêm ít nhất một người đăng ký để tiếp tục

source: Enable schedule
ar: تمكين الجدول
id: Aktifkan jadwal
ja: スケジュールを有効にする
th: เปิดใช้งานกำหนดการ
vi: Bật lịch biểu

source: Add schedule
ar: أضف الجدول
id: Tambahkan jadwal
ja: スケジュールを追加
th: เพิ่มกำหนดการ
vi: Thêm lịch biểu

source: Back
ar: عودة
id: Kembali
ja: バック
th: กลับ
vi: Trở lại

# choose_diff_file
source: Choose a different file
ar: اختر ملفًا مختلفًا
id: Pilih file lain
ja: 別のファイルを選択してください
th: เลือกไฟล์อื่น
vi: Chọn một tệp khác

source: Next
ar: التالي
id: Lanjut
ja: 次
th: ต่อไป
vi: Kế tiếp

source: Done
ar: منجز
id: Selesai
ja: 完了
th: เสร็จแล้ว
vi: Làm xong

# search_br
source: Search business rules
ar: البحث في قواعد العمل
id: Cari aturan bisnis
ja: ビジネスルールを検索する
th: ค้นหากฎทางธุรกิจ
vi: Tìm kiếm quy tắc kinh doanh

# rule_name_missing
source: Please enter rule name
ar: الرجاء إدخال اسم القاعدة
id: Harap masukkan nama aturan
ja: ルール名を入力してください
th: โปรดป้อนชื่อกฎ
vi: Vui lòng nhập tên quy tắc

# error_msg_missing
source: Please enter error message
ar: الرجاء إدخال رسالة خطأ
id: Harap masukkan pesan kesalahan
ja: エラーメッセージを入力してください
th: กรุณากรอกข้อความแสดงข้อผิดพลาด
vi: Vui lòng nhập thông báo lỗi

source: Regex value
ar: قيمة Regex
id: Nilai ekspresi reguler
ja: 正規表現値
th: ค่า Regex
vi: Giá trị regex

# regex_missing
source: Please enter regex
ar: الرجاء إدخال regex
id: Harap masukkan ekspresi reguler
ja: 正規表現を入力してください
th: โปรดป้อน regex
vi: Vui lòng nhập regex

source: Language & format
ar: اللغة والشكل
id: Bahasa & Format
ja: 言語と形式
th: ภาษาและรูปแบบ
vi: Ngôn ngữ & định dạng

source: Language
ar: لغة
id: Bahasa
ja: 言語
th: ภาษา
vi: ngôn ngữ

source: Type to search
ar: اكتب للبحث
id: Ketik untuk mencari
ja: 検索に入力し
th: พิมพ์เพื่อค้นหา
vi: Nhập để tìm kiếm

source: Time Zone
ar: وحدة زمنية
id: Zona waktu
ja: タイムゾーン
th: เขตเวลา
vi: Múi giờ

source: Date format
ar: صيغة التاريخ
id: Format tanggal
ja: 日付フォーマット
th: รูปแบบวันที่
vi: Định dạng ngày tháng

source: Time format
ar: تنسيق الوقت
id: Format waktu
ja: 時刻形式
th: รูปแบบเวลา
vi: định dạng thời gian

source: Number format
ar: شكل رقم
id: format angka
ja: 数値形式
th: รูปแบบตัวเลข
vi: Định dạng số

# execution_download_error
source: Something went wrong, try later
ar: حدث خطأ ما ، حاول لاحقًا
id: Ada yang tidak beres, coba lagi nanti
ja: 何か問題が発生しました。後で試してください
th: เกิดข้อผิดพลาดโปรดลองในภายหลัง
vi: Đã xảy ra sự cố, hãy thử lại sau

source: Please select category
ar: الرجاء تحديد الفئة
id: Silakan pilih kategori
ja: カテゴリを選択
th: กรุณาเลือกหมวดหมู่
vi: Vui lòng chọn loại

source: Send via email
ar: أرسل عبر البريد الإلكتروني
id: Kirim melalui email
ja: メールで送信
th: ส่งทางอีเมล
vi: Gửi qua email

# select_template
source: Select a template
ar: حدد قالبًا
id: Pilih template
ja: テンプレートを選択する
th: เลือกเทมเพลต
vi: Chọn một mẫu

source: send
ar: إرسال
id: Kirim
ja: 送信
th: ส่ง
vi: Gửi

source: Send to
ar: ارسل إلى
id: Kirim ke
ja: に送る
th: ส่งถึง
vi: Gửi đến

source: Subject
ar: موضوع البريد الإلكتروني
id: Subyek
ja: 件名
th: เรื่อง
vi: Môn học

source: Message
ar: رسالة
id: Pesan
ja: メッセージ
th: ข้อความ
vi: Thông điệp

source: Attachment Format
ar: تنسيق المرفق
id: Format Lampiran
ja: 添付ファイル形式
th: รูปแบบไฟล์แนบ
vi: Định dạng tệp đính kèm

source: Template Name
ar: اسم القالب
id: Nama Template
ja: テンプレート名
th: ชื่อเทมเพลต
vi: Tên mẫu

source: Import Logs
ar: سجلات الاستيراد
id: Impor Log
ja: ログのインポート
th: นำเข้าบันทึก
vi: Nhập nhật ký

source: Warning
ar: سجلات الاستيراد
id: Peringatan
ja: 警告
th: คำเตือน
vi: Cảnh báo

source: Status
ar: حالة
ja: 状態
th: สถานะ
vi: Trạng thái

source: Updated
ar: محدث
id: Diperbarui
ja: 更新しました
th: อัปเดตแล้ว
vi: Đã cập nhật

# resetFilters
source: Reset all filters
ar: إعادة تعيين جميع المرشحات
id: Setel ulang semua filter
ja: すべてのフィルターをリセットする
th: รีเซ็ตตัวกรองทั้งหมด
vi: Đặt lại tất cả các bộ lọc

source: Configure filters
ar: تكوين عوامل التصفية
id: Konfigurasikan filter
ja: フィルタを構成する
th: กำหนดค่าตัวกรอง
vi: Định cấu hình bộ lọc

source: Import Report
ar: تقرير الاستيراد
id: Laporan Impor
ja: レポートのインポート
th: รายงานการนำเข้า
vi: Báo cáo nhập

# upload_file
source: Upload a file
ar: قم بتحميل ملف
id: Unggah file
ja: ファイルのアップロード
th: อัปโหลดไฟล์
vi: Tải lên tệp

# upload_mdoreport
source: Upload a .mdopage report file
ar: تحميل ملف تقرير mdopage
id: Unggah file laporan .mdopage
ja: 。mdopageレポートファイルのアップロード
th: อัปโหลดไฟล์รายงาน. mdopage
vi: Tải lên tệp báo cáo .mdopage

source: Replace existing
ar: استبدال القائمة
id: Ganti yang ada
ja: 既存のレポートの置き換え
th: แทนที่ที่มีอยู่
vi: Thay thế hiện có

source: Duplicate report
ar: تقرير غير مكرر
id: Laporan duplikat
ja: レポートの複製
th: รายงานซ้ำ
vi: Báo cáo trùng lặp

source: Add report
ar: إضافة تقرير
id: Tambahkan laporan
ja: レポートの追加
th: เพิ่มรายงาน
vi: Thêm báo cáo

source: Import
ar: يستورد
id: Impor
ja: インポート
th: นำเข้า
vi: Nhập

source: Description
ar: وصف
id: Deskripsi
ja: 説明
th: รายละเอียด
vi: Mô tả

source: Import date
ar: تاريخ الاستيراد
id: Tanggal impor
ja: インポート日
th: วันที่นำเข้า
vi: Ngày nhập

source: Duplicate report name
ar: اسم تقرير مكرر
id: Nama laporan duplikat
ja: レポート名が重複しています
th: ชื่อรายงานที่ซ้ำกัน
vi: Tên báo cáo trùng lặp

source: Missing module
ar: وحدة مفقودة
id: Modul hilang
ja: モジュールがありません
th: โมดูลที่ขาดหายไป
vi: Thiếu mô-đun

source: Export report
ar: تقرير التصدير
id: Ekspor Laporan
ja: レポートのエクスポート
th: รายงานการส่งออก
vi: Báo cáo xuất khẩu

source: Download
ar: تحميل
id: Unduh
ja: ダウンロード
th: ดาวน์โหลด
vi: Tải xuống

source: End
ar: نهاية
id: Akhir
ja: 終わり
th: สิ้นสุด
vi: Kết thúc

source: Start
ar: بداية
id: Mulailah
ja: 開始
th: เริ่ม
vi: Khởi đầu

source: Show selected
ar: إظهار المحدد
id: Tampilkan yang dipilih
ja: 選択したものを表示
th: แสดงรายการที่เลือก
vi: Hiển thị đã chọn

source: Rule
ar: قاعدة
id: Aturan
ja: ルール
th: กฎ
vi: Qui định

source: Equal
ar: متساوي
id: Sama
ja: 等しい
th: เท่ากัน
vi: Công bằng

source: Not Equal
ar: ليس متساوي
id: Tidak sama
ja: 等しくない
th: ไม่เท่ากับ
vi: Không công bằng

source: Starts With
ar: ابدا ب
id: Dimulai dengan
ja: で始まる
th: เริ่มต้นด้วย
vi: Bắt đầu với

source: Ends With
ar: ينتهي بـ
id: Berakhir dengan
ja: で終わる
th: ลงท้ายด้วย
vi: Kết thúc với

source: Contains
ar: يتضمن
id: Mengandung
ja: 含む
th: ประกอบด้วย
vi: Chứa đựng

source: Empty
ar: فارغة
id: Kosong
ja: 空の
th: ว่างเปล่า
vi: Trống

source: Not Empty
ar: ليس فارغًا
id: Tidak kosong
ja: 空ではない
th: ไม่ว่าง
vi: Không rỗng

source: Less Than
ar: أقل من
id: Kurang dari
ja: 未満
th: น้อยกว่า
vi: Ít hơn

source: Less Than Equal To
ar: أقل من يساوي
id: Kurang Dari Sama Dengan
ja: 等しい以下
th: น้อยกว่าเท่ากับ
vi: Nhỏ hơn bằng

source: Greater Than
ar: أكثر من
id: Lebih besar dari
ja: より大きい
th: มากกว่า
vi: Lớn hơn

source: Greater Than Equal To
ar: أكبر من يساوي
id: Lebih Besar dari Setara
ja: より大きい
th: มากกว่าเท่ากับ
vi: Lớn hơn bằng

source: Field To Field
ar: حقل إلى مجال
id: Lapangan Ke Lapangan
ja: フィールド・トゥ・フィールド
th: สนามสู่สนาม
vi: Trường Đến Trường

source: Location
ar: موقع
id: Lokasi
ja: ロケーション
th: ที่ตั้ง
vi: Vị trí

source: Field To Field Equal
ar: حقل إلى حقل يساوي
id: Bidang Ke Lapangan Sama
ja: フィールドからフィールドへの等しい
th: สนามสู่สนามเท่ากับ E
vi: Trường để Trường bằng

source: Field To Field Greater Than Equal
ar: حقل إلى حقل أكبر من يساوي
id: Bidang Ke Lapangan Lebih Besar dari Setara
ja: 等号以上のフィールド間
th: สนามสู่สนามมากกว่าเท่าเทียม
vi: Trường để Trường Lớn hơn Bằng

source: Field To Field Greater Than
ar: حقل إلى حقل أكبر من
id: Lapangan Ke Lapangan Lebih Besar dari
ja: より大きいフィールド間
th: ทุ่งสู่ทุ่งมากกว่า Great
vi: Trường Đến Trường Lớn hơn

source: Field To Field Less Than
ar: حقل إلى مجال أقل من
id: Lapangan Ke Lapangan Kurang Dari
ja: より少ないフィールド間
th: สนามสู่สนามน้อยกว่า
vi: Trường Đến Trường Ít hơn

source: Field To Field Less Than Equal
ar: حقل إلى حقل أقل من يساوي
id: Bidang Ke Bidang Kurang Dari Sama
ja: 等しい以下のフィールド間
th: ฟิลด์ต่อฟิลด์น้อยกว่าเท่ากัน
vi: Trường Đến Trường Nhỏ hơn Bằng

source: Collaborators
ar: المتعاونون
id: Kolaborator
ja: 共同編集者
th: ผู้ร่วมงาน
vi: Cộng tác viên

# type_user_name
source: Type user name to add
ar: اكتب اسم المستخدم لإضافته
id: Ketik nama pengguna untuk ditambahkan
ja: 追加するユーザー名を入力します
th: พิมพ์ชื่อผู้ใช้ที่จะเพิ่ม
vi: Nhập tên người dùng để thêm

source: Collaborator
ar: متعاون
id: Kolaborator
ja: 協力者
th: ผู้ร่วมงาน
vi: Cộng tác viên

source: Yes
ar: نعم
id: Iya
ja: はい
th: ใช่
vi: Đúng

source: No
ar: لا
id: Tidak
ja: 番号
th: ไม่
vi: Không

source: Workflow path
ar: مسار سير العمل
id: Jalur alur kerja
ja: ワークフローパス
th: เส้นทางเวิร์กโฟลว์
vi: Đường dẫn quy trình làm việc

source: Aggregration operator
ar: عامل التجميع
id: Operator agregasi
ja: 集計演算子
th: ตัวดำเนินการรวบรวม
vi: Toán tử tổng hợp

source: Group by
ar: مجموعة من
id: Kelompokkan menurut
ja: グループ化
th: จัดกลุ่มโดย
vi: Nhóm theo

source: Count
ar: عدد
id: Menghitung
ja: カウント
th: นับ
vi: Đếm

source: Sum
ar: مجموع
id: Jumlah
ja: 和
th: ซำ
vi: Tổng

# min
source: Minimum
ar: الحد الأدنى
ja: 最小
th: ขั้นต่ำ
vi: Tối thiểu

# max
source: Maximum
ar: أقصى
id: Maksimum
ja: 最大
th: ขีดสุด
vi: Tối đa

source: Median
ar: الوسيط
ja: 中央値
th: ค่ามัธยฐาน
vi: Trung bình

source: Mode
ar: الوضع
ja: モード
th: โหมด
vi: Chế độ

# avg
source: Average/Mean
ar: متوسط ​​متوسط
id: Rata-rata/Rata-rata
ja: 平均/平均
th: ค่าเฉลี่ย/ค่าเฉลี่ย
vi: Trung bình / Trung bình

# includeField
source: Include field as distinct
ar: تضمين الحقل كمتميز
id: Sertakan bidang sebagai pembeda
ja: フィールドを個別に含める
th: รวมฟิลด์เป็นความแตกต่าง
vi: Bao gồm trường dưới dạng riêng biệt

source: Select default days
ar: حدد الأيام الافتراضية
id: Pilih hari default
ja: デフォルトの日を選択
th: เลือกวันเริ่มต้น
vi: Chọn ngày mặc định

source: No date
ar: بدون تاريخ
id: Tidak ada tanggal
ja: 日付なし
th: ไม่มีวันที่
vi: Không hẹn hò

# DAY_7
source: 7 days
ar: 7 أيام
id: 7 hari
ja: 7日
th: 7 วัน
vi: 7 ngày

# DAY_10
source: 10 days
ar: 10 أيام
id: 10 hari
ja: 10日間
th: 10 วัน
vi: 10 ngày

# DAY_20
source: 20 days
ar: 20 يوم
id: 20 hari
ja: 20日間
th: 20 วัน
vi: 20 ngày

# DAY_30
source: 30 days
ar: 30 يوما
id: 30 hari
ja: 30日
th: 30 วัน
vi: 30 ngày

# CUSTOM
source: Custom date
ar: تاريخ مخصص
id: Tanggal kustom
ja: カスタム日付
th: วันที่กำหนดเอง
vi: Ngày tùy chỉnh

source: Filter type
ar: نوع فلتر
id: Jenis filter
ja: フィルタータイプ
th: ประเภทตัวกรอง
vi: Tuýt lọc

source: Dropdown value
ar: القيمة المنسدلة
id: Nilai tarik-turun
ja: ドロップダウン値
th: ค่าดร็อปดาวน์
vi: Giá trị thả xuống

source: Horizontal value
ar: القيمة الأفقية
id: Nilai horizontal
ja: 水平値
th: ค่าแนวนอน
vi: Giá trị ngang

source: Vertical value
ar: القيمة العمودية
id: Nilai vertikal
ja: 垂直値
th: มูลค่าแนวตั้ง
vi: Giá trị dọc

source: Is multiselect
ar: متعدد التحديد
id: Apakah multipilih?
ja: マルチセレクトです
th: เป็นแบบเลือกได้หลายแบบ
vi: Là nhiều lựa chọn

source: Column format
ar: تنسيق العمود
id: format kolom
ja: 列の形式
th: รูปแบบคอลัมน์
vi: Định dạng cột

# globalFiltersNA
source: Global Filters not applicable
ar: المرشحات العالمية غير قابلة للتطبيق
id: Filter Global tidak berlaku
ja: グローバルフィルターは適用されません
th: ไม่สามารถใช้ตัวกรองร่วมได้
vi: Bộ lọc Toàn cầu không áp dụng

source: Chart properties
ar: خصائص الرسم البياني
id: Properti bagan
ja: チャートのプロパティ
th: คุณสมบัติแผนภูมิ
vi: Thuộc tính biểu đồ

source: Chart type
ar: نوع التخطيط
id: Jenis bagan
ja: チャートタイプ
th: ประเภทแผนภูมิ
vi: Loại biểu đồ

source: Pie
ar: فطيرة
id: Pai
ja: パイ
th: พาย
vi: Bánh

source: Bar
ar: حاجز
id: Batang
ja: バー
th: บาร์
vi: Quán ba

source: Line
ar: خط
id: Garis
ja: ライン
th: ไลน์
vi: Hàng

source: Orientation
ar: اتجاه
id: Orientasi
ja: オリエンテーション
th: ปฐมนิเทศ
vi: Sự định hướng

source: Vertical
ar: عمودي
id: Vertikal
ja: 垂直
th: แนวตั้ง
vi: Theo chiều dọc

source: Horizontal
ar: أفقي
id: Horisontal
ja: 水平
th: แนวนอน
vi: Ngang

source: Enable datalabels
ar: تفعيل علامات البيانات
id: Aktifkan label data
ja: データラベルを有効にする
th: เปิดใช้งาน datalabels
vi: Bật nhãn dữ liệu

source: Datalabels position
ar: موقف Datalabels
id: Posisi label data
ja: データラベルの位置
th: ตำแหน่งป้ายข้อมูล
vi: Vị trí nhãn dữ liệu

source: Center
ar: مركز
id: Pusat
ja: センター
th: ศูนย์
vi: Trung tâm

source: Show data in %
ar: إظهار البيانات في٪
id: Tampilkan data dalam %
ja: データを％で表示
th: แสดงข้อมูลเป็น %
vi: Hiển thị dữ liệu trong%

source: Show legend
ar: عرض الأسطورة
id: Tampilkan legenda
ja: 凡例を表示
th: แสดงตำนาน
vi: Hiển thị chú giải

# showTotal
source: Show total count
ar: إظهار العدد الإجمالي
id: Tampilkan jumlah total
ja: 総数を表示
th: แสดงจำนวนทั้งหมด
vi: Hiển thị tổng số

source: Legend position
ar: موقف الأسطورة
id: Posisi legenda
ja: 凡例の位置
th: ตำแหน่งในตำนาน
vi: Vị trí chú giải

source: Top
ar: قمة
id: Puncak
ja: 上
th: ท็อป
vi: Hàng đầu

source: Left
ar: غادر
id: Kiri
ja: 左
th: ซ้าย
vi: Trái

source: Bottom
ar: الأسفل
id: Bawah
ja: 下
th: ด้านล่าง
vi: Dưới cùng

source: Right
ar: حق
id: Baik
ja: 正しい
th: ขวา
vi: Đúng

source: Series with
ar: سلسلة مع
id: Seri dengan
ja: とのシリーズ
th: ซีรีส์กับ
vi: Sê-ri với

source: Day
ar: يوم
id: Hari
ja: 日
th: วัน
vi: ngày

source: Week
ar: أسبوع
id: Minggu
ja: 週間
th: สัปดาห์
vi: Tuần

source: Month
ar: شهر
id: Bulan
ja: 月
th: เดือน
vi: tháng

source: Quarter
ar: ربع
id: Perempat
ja: 四半期
th: ไตรมาส
vi: Phần tư

source: Year
ar: سنة
id: Tahun
ja: 年
th: ปี
vi: Năm

source: Series format
ar: تنسيق السلسلة
id: Format seri
ja: シリーズフォーマット
th: รูปแบบซีรีส์
vi: Định dạng sê-ri

source: Select interval
ar: حدد الفاصل الزمني
id: Pilih interval
ja: 間隔を選択
th: เลือกช่วงเวลา
vi: Chọn khoảng thời gian

# SLAFilter
source: SLA/ time spent filter
ar: SLA / مرشح الوقت المنقضي
id: Filter SLA/ waktu yang dihabiskan
ja: SLA /フィルターに費やした時間
th: SLA/ ตัวกรองเวลาที่ใช้ไป
vi: SLA / bộ lọc thời gian dành

# dafaultSLA
source: Default SLA
ar: تقصير SLA
id: SLA bawaan
ja: デフォルトのSLA
th: SLA . เริ่มต้น
vi: SLA mặc định

# useCustomSLAValue
source: Use Custom value
ar: استخدم قيمة مخصصة
id: Gunakan nilai Kustom
ja: カスタム値を使用
th: ใช้ค่าที่กำหนดเอง
vi: Sử dụng giá trị tùy chỉnh

source: None
ar: لا أحد
id: Tidak ada
ja: 無し
th: ไม่มี
vi: không ai

# withinSLA
source: Within time limit
ar: ضمن المهلة المحددة
id: Dalam batas waktu
ja: 制限時間内
th: ภายในเวลาที่กำหนด
vi: Trong thời hạn

# exceedsSLA
source: Exceeds time limit
ar: يتجاوز الحد الزمني
id: Melebihi batas waktu
ja: 制限時間を超えています
th: เกินเวลาที่กำหนด
vi: Vượt quá giới hạn thời gian

# schema_running_msg
source: This schema is running Click here to either track the progress or see result
ar: هذا المخطط قيد التشغيل انقر هنا إما لتتبع التقدم أو لمشاهدة النتيجة
id: Skema ini sedang berjalan Klik di sini untuk melacak kemajuan atau melihat hasilnya
ja: このスキーマは実行中です進行状況を追跡するか結果を確認するには、ここをクリックしてください
th: สคีมานี้กำลังทำงาน คลิกที่นี่เพื่อติดตามความคืบหน้าหรือดูผลลัพธ์
vi: Lược đồ này đang chạy Nhấp vào đây để theo dõi tiến trình hoặc xem kết quả

source: Weight
ar: وزن
id: Bobot
ja: 重量
th: น้ำหนัก
vi: Cân nặng

source: Type
ar: يكتب
id: Tipe
ja: タイプ
th: พิมพ์
vi: Kiểu

# new_br_rule
source: New business rule
ar: قاعدة عمل جديدة
id: Aturan bisnis baru
ja: 新しいビジネスルール
th: กฎธุรกิจใหม่
vi: Quy tắc kinh doanh mới

source: Accuracy Score
ar: دقة النتيجة
id: akurasi Skor
ja: 精度スコア
th: คะแนนความถูกต้อง
vi: Điểm chính xác

# accuracy_score_missing_msg
source: Please enter accuracy score
ar: الرجاء إدخال درجة دقة
id: Masukkan skor akurasi
ja: 精度のスコアを入力してください。
th: กรุณากรอกคะแนนความถูกต้อง
vi: Vui lòng nhập điểm chính xác

source: Source Field
ar: الميدان مصدر
id: sumber Lapangan
ja: ソース・フィールド
th: แหล่งที่มาของสนาม
vi: nguồn Dòng

# source_field_missing
source: Please select the source field
ar: يرجى تحديد الحقل مصدر
id: Pilih bidang sumber
ja: ソースフィールドを選択してください
th: กรุณาเลือกข้อมูลแหล่งที่มา
vi: Vui lòng chọn lĩnh vực nguồn

source: Target Fields
ar: الحقول المستهدفة
ja: ターゲット・フィールド
th: ทุ่งเป้าหมาย

source: Hour
ar: ساعة
id: Jam
ja: 時間
th: ชั่วโมง
vi: Giờ

source: errors
ar: أخطاء
id: kesalahan
ja: エラー
th: ข้อผิดพลาด
vi: lỗi

source: success
ar: نجاح
id: Keberhasilan
ja: 成功
th: ความสำเร็จ
vi: Sự thành công

source: skipped
ar: تم تخطيه
id: dilewati
ja: スキップしました
th: ข้าม
vi: bỏ qua

source: Default value
ar: القيمة الافتراضية
id: nilai default
ja: デフォルト値
th: ค่ามาตรฐาน
vi: giá trị mặc định

source: New value
ar: قيمة جديدة
id: nilai baru
ja: 新しい値
th: ค่าใหม่
vi: giá trị mới

source: Default values
ar: قيم افتراضية
id: nilai dasar
ja: デフォルト値
th: ค่าเริ่มต้น
vi: giá trị mặc định
