Repository: Fardim/sample-code-2022
Catalog: src/locale/messages.*.xlf
Languages: ar, id, ja, th, vi

# default_values_empty_msg
source: You don’t have any values defined for this list yet. Type the value name in the box above to add.
ar: لم يكن لديك أي القيم المحددة لهذه القائمة بعد. اكتب اسم القيمة في المربع أعلاه لإضافة.
id: Anda tidak memiliki nilai yang ditetapkan untuk daftar ini. Ketik nama nilai dalam kotak di atas untuk menambahkan.
ja: あなたはまだこのリストに定義された値はありません。追加するには、上のボックスに値の名前を入力します。
th: คุณไม่ได้มีค่าใด ๆ กำหนดไว้สำหรับรายการนี้เลย พิมพ์ชื่อของค่าในช่องด้านบนเพื่อเพิ่ม
vi: Bạn không có bất kỳ giá trị được định nghĩa cho danh sách này được nêu ra. Gõ tên giá trị vào ô bên trên để thêm.

source: value
ar: القيمة
id: nilai
ja: 値
th: ค่า
vi: giá trị

# type_value_to_add
source: Type value name to add
ar: اكتب اسم القيمة لإضافته
id: Ketik nama nilai untuk ditambahkan
ja: 追加する値の名前を入力します
th: พิมพ์ชื่อค่าที่จะเพิ่ม
vi: Nhập tên giá trị để thêm

source: No results found
ar: لم يتم العثور على نتائج
id: Tidak ada hasil yang ditemukan
ja: 結果が見つかりません
th: ไม่พบผลลัพธ์
vi: không tìm thấy kết quả nào

# isAgingReport
source: Is aging/range report
ar: هو تقرير الشيخوخة / المدى
id: Apakah laporan penuaan/rentang?
ja: 経年変化/範囲レポートです
th: รายงานอายุ/ช่วงอายุ
vi: Có phải báo cáo về độ tuổi / phạm vi

source: Aging/range bucket size
ar: شيخوخة / نطاق حجم دلو
id: Ukuran ember penuaan/rentang
ja: エージング/範囲バケットサイズ
th: ขนาดถังอายุ/ช่วง
vi: Độ tuổi / phạm vi kích thước xô

source: Aging/range bucket limit
ar: التقادم / النطاق المسموح به
id: Batas ember penuaan/rentang
ja: エージング/範囲バケット制限
th: ขีดจำกัดที่เก็บข้อมูลอายุ/ช่วง
vi: Giới hạn độ tuổi / phạm vi nhóm

source: Aging/range calculation field
ar: الشيخوخة / مجال حساب المدى
id: Bidang perhitungan penuaan/rentang
ja: 経年変化/範囲計算フィールド
th: ฟิลด์การคำนวณอายุ/ช่วง
vi: Trường tính toán độ tuổi / phạm vi

source: Date Format Interval
ar: فاصل تنسيق التاريخ
id: Interval Format Tanggal
ja: 日付形式の間隔
th: ช่วงเวลารูปแบบวันที่
vi: Khoảng thời gian định dạng ngày

# isStepWise
source: Stepwise ?
ar: متدرج؟
id: bertahap?
ja: 段階的に？
th: เป็นขั้นเป็นตอน ?
vi: Đi từng bước?

source: Yes ?
ar: نعم
id: Iya
ja: はい
th: ใช่
vi: Đúng

source: Select Step(s)
ar: حدد الخطوة (الخطوات)؟
id: Pilih Langkah
ja: ステップを選択します
th: เลือกขั้นตอน
vi: Chọn (các) bước

# weightage_tooltip
source: Allocate weightage to the Business Rule to determine a successful validation of data. eg. 100% weightage means data in specified fields must exactly meet criteria or error message will display
ar: قم بتخصيص ترجيح لقاعدة العمل لتحديد التحقق من صحة البيانات بنجاح. على سبيل المثال الوزن بنسبة 100٪ يعني أن البيانات الموجودة في الحقول المحددة يجب أن تفي بالمعايير تمامًا وإلا سيتم عرض رسالة الخطأ
id: Alokasikan bobot ke Aturan Bisnis untuk menentukan validasi data yang berhasil. misalnya. Bobot 100% berarti data dalam bidang yang ditentukan harus benar-benar memenuhi kriteria atau pesan kesalahan akan ditampilkan
ja: データの検証が成功したかどうかを判断するために、ビジネスルールに重みを割り当てます。例えば。 100％の重みは、指定されたフィールドのデータが基準を正確に満たしている必要があることを意味します。そうでない場合、エラーメッセージが表示されます
th: จัดสรรน้ำหนักให้กับกฎธุรกิจเพื่อกำหนดการตรวจสอบความถูกต้องของข้อมูล เช่น. น้ำหนัก 100% หมายความว่าข้อมูลในฟิลด์ที่ระบุต้องตรงตามเกณฑ์หรือข้อความแสดงข้อผิดพลาดจะปรากฏขึ้น
vi: Phân bổ trọng số cho Quy tắc kinh doanh để xác định việc xác thực thành công dữ liệu. ví dụ. 100% trọng số có nghĩa là dữ liệu trong các trường được chỉ định phải đáp ứng chính xác tiêu chí hoặc thông báo lỗi sẽ hiển thị

# errormsg_tooltip
source: Enter the error message to display if rule is not met
ar: أدخل رسالة الخطأ التي تريد عرضها إذا لم يتم استيفاء القاعدة
id: Masukkan pesan kesalahan untuk ditampilkan jika aturan tidak terpenuhi
ja: ルールが満たされていない場合に表示するエラーメッセージを入力します
th: ป้อนข้อความแสดงข้อผิดพลาดที่จะแสดงหากไม่เป็นไปตามกฎ
vi: Nhập thông báo lỗi để hiển thị nếu quy tắc không được đáp ứng

# udrmenu_tooltip
source: Add a subsequent child logic or delete the condition
ar: أضف منطقًا فرعيًا لاحقًا أو احذف الشرط
id: Tambahkan logika anak berikutnya atau hapus kondisi
ja: 後続の子ロジックを追加するか、条件を削除します
th: เพิ่มตรรกะลูกที่ตามมาหรือลบเงื่อนไข
vi: Thêm logic con tiếp theo hoặc xóa điều kiện

# activate_trans_help
source: Activate to apply transformation business rule
ar: تنشيط لتطبيق قاعدة أعمال التحويل
id: Aktifkan untuk menerapkan aturan bisnis transformasi
ja: 変換ビジネスルールを適用するためにアクティブ化する
th: เปิดใช้งานเพื่อใช้กฎธุรกิจการเปลี่ยนแปลง
vi: Kích hoạt để áp dụng quy tắc kinh doanh chuyển đổi

# category_tooltip
source: Select the Category for the rule
ar: حدد فئة القاعدة
id: Pilih Kategori untuk aturan
ja: ルールのカテゴリを選択します
th: เลือกหมวดหมู่สำหรับกฎ
vi: Chọn Danh mục cho quy tắc

# standard_function_tooltip
source: Select the standard function of the field
ar: حدد الوظيفة القياسية للحقل
id: Pilih fungsi standar bidang
ja: フィールドの標準機能を選択します
th: เลือกฟังก์ชันมาตรฐานของฟิลด์
vi: Chọn chức năng tiêu chuẩn của trường

# match_tooltip
source: Select duplicate criteria for field as exact or approximate(fuzzy)
ar: حدد معايير مكررة للحقل على أنها دقيقة أو تقريبية (غير واضحة)
id: Pilih kriteria duplikat untuk bidang sebagai tepat atau perkiraan (kabur)
ja: フィールドの重複基準を正確または概算（ファジー）として選択します
th: เลือกเกณฑ์ที่ซ้ำกันสำหรับเขตข้อมูลเป็นค่าที่แน่นอนหรือโดยประมาณ (คลุมเครือ)
vi: Chọn tiêu chí trùng lặp cho trường là chính xác hoặc gần đúng (mờ)

# exclusions_tooltip
source: Enter exclusions and synonyms : words to be excluded from the duplicate check (e.g the) and words that should be considered the same (e.g St = Street)
ar: أدخل الاستبعادات والمرادفات: الكلمات المراد استبعادها من التحقق المكرر (على سبيل المثال ،) والكلمات التي يجب اعتبارها هي نفسها (مثل St = Street)
id: Masukkan pengecualian dan sinonim : kata-kata yang akan dikecualikan dari pemeriksaan duplikat (mis.) dan kata-kata yang harus dianggap sama (mis. St = Jalan)
ja: 除外と同義語を入力してください：重複チェックから除外する単語（例：）と同じと見なす必要のある単語（例：St = Street）
th: ป้อนการยกเว้นและคำพ้องความหมาย : คำที่จะแยกออกจากการตรวจสอบซ้ำ (เช่น ) และคำที่ควรพิจารณาเหมือนกัน (เช่น St = Street)
vi: Nhập các từ loại trừ và từ đồng nghĩa: các từ được loại trừ khỏi kiểm tra trùng lặp (ví dụ:) và các từ cần được coi là giống nhau (ví dụ: St = Street)

source: Exact Match
ar: تطابق تام
id: Benar-benar cocok
ja: 完全に一致
th: คู่ที่เหมาะสม
vi: Kết hợp chuẩn xác

# exact_match_tooltip
source: Duplicate values in fields match exactly
ar: تتطابق القيم المكررة في الحقول تمامًا
id: Nilai duplikat di bidang sama persis
ja: フィールド内の重複する値は完全に一致します
th: ค่าที่ซ้ำกันในฟิลด์ตรงกันทุกประการ
vi: Các giá trị trùng lặp trong các trường khớp chính xác

# fuzzy_tooltip
source: Duplicate values in fields partially match
ar: تتطابق القيم المكررة في الحقول جزئيًا
id: Nilai duplikat di bidang sebagian cocok
ja: フィールド内の重複する値は部分的に一致します
th: ค่าที่ซ้ำกันในฟิลด์ที่ตรงกันบางส่วน
vi: Các giá trị trùng lặp trong các trường khớp một phần

source: Fuzzy
ar: أجعد
id: Kusut
ja: ファジー
th: ฟัซซี่
vi: Mờ

# master_record_tooltip
source: Select criteria to define the master record
ar: حدد المعايير لتحديد السجل الرئيسي
id: Pilih kriteria untuk menentukan master record
ja: マスターレコードを定義するための基準を選択します
th: เลือกเกณฑ์เพื่อกำหนดมาสเตอร์เรคคอร์ด
vi: Chọn tiêu chí để xác định bản ghi chính

# errorMsg
source: Select only numeric/decimal type field.
ar: حدد حقل نوع رقمي / عشري فقط.
id: Pilih hanya bidang tipe numerik/desimal.
ja: 数値/小数型フィールドのみを選択します。
th: เลือกเฉพาะช่องประเภทตัวเลข/ทศนิยม
vi: Chỉ chọn trường loại số / thập phân.

# regexval_tooltip
source: Enter the value for the function selected
ar: أدخل قيمة الوظيفة المحددة
id: Masukkan nilai untuk fungsi yang dipilih
ja: 選択した関数の値を入力します
th: ป้อนค่าสำหรับฟังก์ชันที่เลือก
vi: Nhập giá trị cho chức năng đã chọn

# udr_addrow_tooltip
source: Add another logic or condition to rule by selecting AND / OR
ar: أضف منطقًا أو شرطًا آخر إلى القاعدة عن طريق تحديد AND / OR
id: Tambahkan logika atau kondisi lain ke aturan dengan memilih DAN / ATAU
ja: AND / ORを選択して、ルールに別のロジックまたは条件を追加します
th: เพิ่มตรรกะหรือเงื่อนไขอื่นในกฎโดยเลือก AND / OR
vi: Thêm logic hoặc điều kiện khác vào quy tắc bằng cách chọn VÀ / HOẶC

# accuracy_tooltip
source: The accuracy score of the matched text
ar: درجة دقة النص المطابق
id: Skor akurasi dari teks yang cocok
ja: 一致したテキストの精度スコア
th: คะแนนความถูกต้องของข้อความที่ตรงกัน
vi: Điểm chính xác của văn bản phù hợp

# source_field_tooltip
source: Select the field to extract the manufacturer part number
ar: حدد الحقل لاستخراج رقم جزء الشركة المصنعة
id: Pilih bidang untuk mengekstrak nomor bagian pabrikan
ja: フィールドを選択して、製造元の部品番号を抽出します
th: เลือกช่องเพื่อแยกหมายเลขชิ้นส่วนของผู้ผลิต
vi: Chọn trường để trích xuất số bộ phận của nhà sản xuất

# target_fields_tooltip
source: Select the field(s) to insert the manufacturer part number
ar: حدد الحقل (الحقول) لإدراج رقم جزء الشركة المصنعة
id: Pilih bidang untuk memasukkan nomor bagian pabrikan
ja: フィールドを選択して、メーカーの部品番号を挿入します
th: เลือกช่องที่จะใส่หมายเลขชิ้นส่วนของผู้ผลิต
vi: Chọn (các) trường để chèn số bộ phận của nhà sản xuất

# custom_validation_tooltip
source: Select the validation to be applied
ar: حدد التحقق المراد تطبيقه
id: Pilih validasi yang akan diterapkan
ja: 適用する検証を選択します
th: เลือกการตรวจสอบความถูกต้องที่จะใช้
vi: Chọn xác thực sẽ được áp dụng

# trans_source_field_tooltip
source: Select the fields to have the rule applied
ar: حدد الحقول لتطبيق القاعدة
id: Pilih bidang untuk menerapkan aturan
ja: ルールを適用するフィールドを選択します
th: เลือกช่องที่จะใช้กฎ
vi: Chọn các trường để áp dụng quy tắc

# trans_target_fields_tooltip
source: Select which field(s) will store the results
ar: حدد الحقل (الحقول) الذي سيخزن النتائج
id: Pilih bidang mana yang akan menyimpan hasilnya
ja: 結果を保存するフィールドを選択します
th: เลือกช่องที่จะเก็บผลลัพธ์
vi: Chọn (các) trường sẽ lưu trữ kết quả

source: Extract Value
ar: استخراج القيمة
id: Ekstrak Nilai
ja: 値を抽出する
th: คุณค่าสารสกัด
vi: Trích xuất giá trị

# extract_value_tooltip
source: Extracts the matching text from the source field and enters only the extracted value in the target fields.
ar: استخراج النص المطابق من الحقل المصدر وإدخال القيمة المستخرجة فقط في الحقول الهدف.
id: Mengekstrak teks yang cocok dari bidang sumber dan hanya memasukkan nilai yang diekstraksi di bidang target.
ja: ソースフィールドから一致するテキストを抽出し、抽出された値のみをターゲットフィールドに入力します。
th: แยกข้อความที่ตรงกันจากฟิลด์ต้นทางและป้อนเฉพาะค่าที่แยกออกมาในฟิลด์เป้าหมาย
vi: Trích xuất văn bản phù hợp từ trường nguồn và chỉ nhập giá trị được trích xuất vào các trường đích.

source: Append Value
ar: إلحاق القيمة
id: Tambahkan Nilai
ja: 付加価値
th: ผนวกมูลค่า
vi: Nối giá trị

# append_value_tooltip
source: Check the source field data to append to the target field data
ar: تحقق من بيانات الحقل المصدر لإلحاقها ببيانات الحقل الهدف
id: Periksa data bidang sumber untuk ditambahkan ke data bidang target
ja: ソースフィールドデータを確認して、ターゲットフィールドデータに追加します
th: ตรวจสอบข้อมูลฟิลด์ต้นทางเพื่อผนวกเข้ากับข้อมูลฟิลด์เป้าหมาย
vi: Kiểm tra dữ liệu trường nguồn để thêm vào dữ liệu trường đích

# fields_tooltip
source: Select source fields
ar: حدد الحقول المصدر
id: Pilih bidang sumber
ja: ソースフィールドを選択
th: เลือกช่องต้นทาง
vi: Chọn các trường nguồn

# rule_tooltip
source: Select look up table and columns and select the result lookup column for the result
ar: حدد البحث عن الجدول والأعمدة وحدد عمود البحث عن النتيجة للنتيجة
id: Pilih tabel dan kolom pencarian dan pilih kolom pencarian hasil untuk hasilnya
ja: ルックアップテーブルと列を選択し、結果の結果ルックアップ列を選択します
th: เลือกค้นหาตารางและคอลัมน์และเลือกคอลัมน์ค้นหาผลลัพธ์สำหรับผลลัพธ์
vi: Chọn bảng tra cứu và các cột và chọn cột tra cứu kết quả cho kết quả

# resultin_tooltip
source: Select the target field to display results
ar: حدد الحقل الهدف لعرض النتائج
id: Pilih bidang target untuk menampilkan hasil
ja: 結果を表示するターゲットフィールドを選択します
th: เลือกช่องเป้าหมายเพื่อแสดงผลลัพธ์
vi: Chọn trường mục tiêu để hiển thị kết quả

# data_scope_tooltip
source: Enter the data scope associated to the schema
ar: أدخل نطاق البيانات المرتبط بالمخطط
id: Masukkan cakupan data yang terkait dengan skema
ja: スキーマに関連付けられているデータスコープを入力します
th: ป้อนขอบเขตข้อมูลที่เกี่ยวข้องกับสคีมา
vi: Nhập phạm vi dữ liệu được liên kết với giản đồ

# threshold_tooltip
source: Enter the % to determine the schema success. If the threshold is not met, an error will occur.
ar: أدخل النسبة المئوية لتحديد نجاح المخطط. إذا لم يتم استيفاء الحد الأدنى ، سيحدث خطأ.
id: Masukkan % untuk menentukan keberhasilan skema. Jika ambang batas tidak terpenuhi, kesalahan akan terjadi.
ja: ％を入力して、スキーマの成功を判断します。しきい値に達していない場合、エラーが発生します。
th: ป้อน % เพื่อกำหนดความสำเร็จของสคีมา หากไม่ตรงตามเกณฑ์ จะเกิดข้อผิดพลาด
vi: Nhập% để xác định thành công của lược đồ. Nếu ngưỡng không được đáp ứng, một lỗi sẽ xảy ra.

# business_rule_tooltip
source: Assign business rule(s) to the schema. Note: The combination of all business rules assigned to the schema must have a total weightage of 100
ar: قم بتعيين قاعدة (قواعد) العمل إلى المخطط. ملاحظة: يجب أن تحتوي مجموعة جميع قواعد العمل المعينة للمخطط على إجمالي وزن 100
id: Tetapkan aturan bisnis ke skema. Catatan: Kombinasi semua aturan bisnis yang ditetapkan ke skema harus memiliki bobot total 100
ja: スキーマにビジネスルールを割り当てます。注：スキーマに割り当てられたすべてのビジネスルールの組み合わせには、合計100の重みが必要です。
th: กำหนดกฎเกณฑ์ทางธุรกิจให้กับสคีมา หมายเหตุ: การรวมกฎทางธุรกิจทั้งหมดที่กำหนดให้กับสคีมาต้องมีน้ำหนักรวม 100
vi: Gán (các) quy tắc nghiệp vụ cho lược đồ. Lưu ý: Sự kết hợp của tất cả các quy tắc nghiệp vụ được chỉ định cho giản đồ phải có tổng trọng số là 100

# collaborators_tooltip
source: Select users to receive updates or perform tasks associated to schema
ar: حدد المستخدمين لتلقي التحديثات أو تنفيذ المهام المرتبطة بالمخطط
id: Pilih pengguna untuk menerima pembaruan atau melakukan tugas yang terkait dengan skema
ja: 更新を受信したり、スキーマに関連付けられたタスクを実行したりするユーザーを選択します
th: เลือกผู้ใช้เพื่อรับการอัปเดตหรือทำงานที่เกี่ยวข้องกับสคีมา
vi: Chọn người dùng để nhận các bản cập nhật hoặc thực hiện các tác vụ được liên kết với giản đồ

source: Fix now
ar: اصلح الان
id: Memperbaiki Sekarang
ja: 今すぐ修正
th: แก้ไขเดี๋ยวนี้
vi: Khắc phục ngay bây giờ

# sign_here_using_mouse
source: Sign here using your mouse
ar: التوقيع هنا باستخدام الماوس
id: Masuk di sini menggunakan mouse Anda
ja: あなたのマウスを使用して、ここでサイン
th: เข้าสู่ระบบที่นี่ใช้เมาส์ของคุณ
vi: Ký tên ở đây sử dụng con chuột của bạn

source: Allow notifications
ar: السماح بالإشعارات
id: Benarkan pemberitahuan
ja: 通知を許可する
th: อนุญาตการแจ้งเตือน
vi: Cho phép thông báo

source: Event Name
ar: اسم الحدث
id: Nama acara
ja: イベント名
th: ชื่อเหตุการณ์
vi: Tên sự kiện

source: Desktop
ar: سطح المكتب
ja: デスクトップ
th: เดสก์ทอป
vi: Máy tính để bàn

source: Mobile
ar: التليفون المحمول
id: Mudah alih
ja: モバイル
th: มือถือ
vi: Di động

source: Email
ar: بريد إلكتروني
id: E-mel
ja: Eメール
th: อีเมล์

# desktop_tooltip
source: Notification will be displayed in the System Tray
ar: سيتم عرض الإخطار في علبة النظام
id: Pemberitahuan akan dipaparkan di System Tray
ja: 通知はシステムトレイに表示されます
th: การแจ้งเตือนจะแสดงในถาดระบบ
vi: Thông báo sẽ được hiển thị trong Khay hệ thống

# mobile_tooltip
source: Notification will be displayed in the mobile
ar: سيتم عرض الإخطار في الهاتف المحمول
id: Pemberitahuan akan dipaparkan di telefon bimbit
ja: 通知はモバイルに表示されます
th: การแจ้งเตือนจะแสดงในมือถือ
vi: Thông báo sẽ được hiển thị trong điện thoại di động

# notifications_are_not_allowed
source: Notifications are not currently allowed
ar: الإخطارات غير مسموح بها حاليا
id: Pemberitahuan tidak dibenarkan buat masa ini
ja: 現在、通知は許可されていません
th: ไม่อนุญาตการแจ้งเตือนในขณะนี้
vi: Thông báo hiện không được phép

source: Do not send
ar: لا ترسل
id: Jangan hantar
ja: 送信しない
th: ไม่ได้ส่ง
vi: Đừng gửi

source: When event occurs
ar: عندما يقع الحدث
id: Apabila peristiwa berlaku
ja: イベント発生時
th: เมื่อเกิดเหตุการณ์
vi: Khi sự kiện xảy ra

source: Weekly digest
ar: الملخص الأسبوعي
id: Pencernaan setiap minggu
ja: ウィークリーダイジェスト
th: สรุปรายสัปดาห์
vi: Thông báo hàng tuần

source: New Tag
ar: يوم جديد
id: Tag Baru
ja: 新しいタグ
th: แท็กใหม่
vi: Thẻ mới

source: Tags
ar: العلامات
id: Tag
ja: タグ
th: แท็ก
vi: Thẻ

source: Tag
ar: بطاقة شعار
id: Menandai
ja: 鬼ごっこ
th: แท็ก
vi: Nhãn

source: Merge
ar: دمج
id: Menggabungkan
ja: マージ
th: ผสาน
vi: Hợp nhất

source: Clear Selection
ar: التحديد الواضح
id: Hapus Pilihan
ja: 明確な選択
th: ล้างการเลือก
vi: Xóa lựa chọn

source: Usage
ar: إستعمال
id: Pemakaian
ja: 使用法
th: การใช้งาน
vi: Sử dụng

source: New Tag Name
ar: اسم العلامة الجديدة
id: Nama Tag Baru
ja: 新しいタグ名
th: ชื่อแท็กใหม่
vi: Tên thẻ mới

source: Merge Tags
ar: دمج العلامات
id: Gabungkan Tag
ja: タグをマージする
th: รวมแท็ก
vi: Hợp nhất các thẻ

# merge_tags_banner
source: The tag usage information will also be merged
ar: سيتم أيضًا دمج معلومات استخدام العلامة
id: Informasi penggunaan tag juga akan digabungkan
ja: タグの使用情報もマージされます
th: ข้อมูลการใช้แท็กจะถูกรวมเข้าด้วยกัน
vi: Thông tin sử dụng thẻ cũng sẽ được hợp nhất

source: Consolidated Tag Name
ar: اسم العلامة الموحدة
id: Nama Tag Gabungan
ja: 統合されたタグ名
th: ชื่อแท็กรวม
vi: Tên thẻ hợp nhất

# delete_confirmation_message
source: Are you sure you want to proceed?
ar: هل انت متأكد انك تريد المتابعة؟
id: Anda yakin ingin melanjutkan?
ja: 続行してもよろしいですか？
th: แน่ใจไหมว่าต้องการดำเนินการต่อ
vi: Bạn có chắc muốn tiếp tục?

# tag_merge_success
source: Tags merged Successfully
ar: تم دمج العلامات بنجاح
id: Tag Berhasil digabungkan
ja: タグが正常にマージされました
th: รวมแท็กเรียบร้อยแล้ว
vi: Các thẻ được hợp nhất thành công

# tag_merge_fail
source: Tags merge Failed
ar: فشل دمج العلامات
id: Penggabungan tag Gagal
ja: タグのマージに失敗しました
th: การรวมแท็กล้มเหลว
vi: Hợp nhất thẻ không thành công

source: New Dataset
ar: مجموعة البيانات الجديدة
id: Kumpulan Data Baru
ja: 新しいデータセット
th: ชุดข้อมูลใหม่
vi: Tập dữ liệu mới

source: Connect To
ar: اتصل بـ
id: Terhubung ke
ja: に接続します
th: เชื่อมต่อกับ
vi: Kết nối với

# connect_to_details
source: Bring your data accross from another system
ar: اجلب بياناتك عبر نظام آخر
id: Bawa data Anda dari sistem lain
ja: 別のシステムからデータを持ち込む
th: นำข้อมูลของคุณข้ามจากระบบอื่น
vi: Mang dữ liệu của bạn qua hệ thống khác

source: Select
ar: يختار
id: Pilih
ja: 選択する
th: เลือก
vi: Lựa chọn

source: Load from file
ar: تحميل من ملف
id: Muat dari file
ja: ファイルからロード
th: โหลดจากไฟล์
vi: Tải từ tệp

# load_from_file_details
source: Create a dataset by uploading a file with data
ar: قم بإنشاء مجموعة بيانات عن طريق تحميل ملف بالبيانات
id: Buat kumpulan data dengan mengunggah file dengan data
ja: データを含むファイルをアップロードしてデータセットを作成する
th: สร้างชุดข้อมูลโดยการอัปโหลดไฟล์ที่มี
vi: Tạo tập dữ liệu bằng cách tải lên tệp có dữ liệu

source: Create manually
ar: إنشاء يدويًا
id: Buat secara manual
ja: 手動で作成
th: สร้างด้วยตนเอง
vi: Tạo thủ công

# create_manually_details
source: Create a dataset by defining its content manually
ar: قم بإنشاء مجموعة بيانات عن طريق تحديد محتواها يدويًا
id: Buat kumpulan data dengan mendefinisikan kontennya secara manual
ja: コンテンツを手動で定義してデータセットを作成する
th: สร้างชุดข้อมูลโดยกำหนดเนื้อหาด้วยตนเอง
vi: Tạo tập dữ liệu bằng cách xác định nội dung của nó theo cách thủ công

source: Dataset ID
ar: معرف مجموعة البيانات
id: ID kumpulan data
ja: データセットID
th: รหัสชุดข้อมูล
vi: ID tập dữ liệu

source: Dataset name
ar: اسم مجموعة البيانات
id: Nama kumpulan data
ja: データセット名
th: ชื่อชุดข้อมูล
vi: Tên tập dữ liệu

source: Dataset description
ar: وصف مجموعة البيانات
id: Deskripsi kumpulan data
ja: データセットの説明
th: คำอธิบายชุดข้อมูล
vi: Mô tả tập dữ liệu

source: Dataset Company ID
ar: معرف شركة مجموعة البيانات
id: ID Perusahaan Kumpulan Data
ja: データセット会社ID
th: ชุดข้อมูล ID บริษัท
vi: Mã công ty tập dữ liệu

# single_record_data
source: Single record dataset (at tenant level)
ar: مجموعة بيانات قياسية واحدة (على مستوى المستأجر)
id: Dataset rekaman tunggal (di tingkat penyewa)
ja: 単一レコードのデータセット (テナント レベル)
th: ชุดข้อมูลระเบียนเดียว (ที่ระดับผู้เช่า)
vi: Tập dữ liệu bản ghi duy nhất (ở cấp độ người thuê)

source: App name
ar: اسم التطبيق
id: Nama aplikasi
ja: アプリ名
th: ชื่อแอป
vi: Tên ứng dụng

source: Industry
ar: صناعة
id: Industri
ja: 業界
th: อุตสาหกรรม
vi: Ngành công nghiệp

source: System type
ar: نوع النظام
id: Tipe sistem
ja: システムタイプ
th: ประเภทระบบ
vi: Loại hệ thống

source: Owner
ar: مالك
id: Pemilik
ja: オーナー
th: เจ้าของ
vi: Chủ nhân

source: Datatype
ar: نوع البيانات
id: Tipe data
ja: データ・タイプ
th: ประเภทข้อมูล
vi: Loại dữ liệu

source: Persistence
ar: إصرار
id: Kegigihan
ja: 持続性
th: วิริยะ
vi: Sự bền bỉ

source: Data privacy
ar: خصوصية البيانات
id: Privasi data
ja: データのプライバシー
th: ความเป็นส่วนตัวของข้อมูล
vi: Bảo mật dữ liệu

# parent_dataset
source: Parent dataset(s)
ar: مجموعة (مجموعات) البيانات الأصل
id: Set data induk
ja: 親データセット
th: ชุดข้อมูลหลัก
vi: (Các) tập dữ liệu mẹ

# download_dataset_config
source: Download Dataset Configuration
ar: تنزيل تكوين مجموعة البيانات
id: Unduh Konfigurasi Dataset
ja: データセット設定をダウンロード
th: ดาวน์โหลดการกำหนดค่าชุดข้อมูล
vi: Tải xuống cấu hình tập dữ liệu

# upload_dataset_config
source: Upload Dataset Configuration
ar: تحميل تكوين مجموعة البيانات
id: Unggah Konfigurasi Dataset
ja: データセット設定のアップロード
th: อัปโหลดการกำหนดค่าชุดข้อมูล
vi: Tải lên cấu hình tập dữ liệu

source: Update Dataset
ar: تحديث مجموعة البيانات
id: Perbarui Kumpulan Data
ja: データセットを更新する
th: อัปเดตชุดข้อมูล
vi: Cập nhật tập dữ liệu

source: Update
ar: 更新
id: Memperbarui
ja: 更新
th: อัพเดท
vi: Cập nhật

source: Password Policy
ar: سياسة كلمة المرور
id: Kebijakan Kata Sandi
ja: パスワードポリシー
th: นโยบายรหัสผ่าน
vi: Chính sách mật khẩu

source: Minimum length
ar: الطول الأدنى
id: Panjang minimum
ja: 最小長さ
th: ความยาวขั้นต่ำ
vi: Chiều dài tối thiểu

source: Uppercase (A-Z)
ar: الأحرف الكبيرة (A-Z)
id: Huruf Besar (A-Z)
ja: 大文字 (A-Z)
th: ตัวพิมพ์ใหญ่ (A-Z)
vi: Chữ hoa (A-Z)

source: Lowercase (A-Z)
ar: صغير (A-Z)
id: Huruf kecil (A-Z)
ja: 小文字（A～Z）
th: ตัวพิมพ์เล็ก (A-Z)
vi: Chữ thường (A-Z)

source: Digit (0-9)
ar: رقم (0-9)
id: Angka (0-9)
ja: 数字 (0 ～ 9)
th: ตัวเลข (0-9)
vi: Chữ số (0-9)

source: Special Characters
ar: شخصيات خاصة
id: Karakter spesial
ja: 特殊文字
th: ตัวละครพิเศษ
vi: Các ký tự đặc biệt

# password_reset
source: Initial login password reset
ar: إعادة تعيين كلمة مرور تسجيل الدخول الأولية
id: Reset kata sandi login awal
ja: 初回ログインパスワードのリセット
th: รีเซ็ตรหัสผ่านเข้าสู่ระบบเริ่มต้น
vi: Đặt lại mật khẩu đăng nhập ban đầu

# system_defined_values
source: System define values
ar: يحدد النظام القيم
id: Sistem menentukan nilai
ja: システム定義値
th: ระบบกำหนดค่า
vi: Hệ thống xác định giá trị

# user_defined_values
source: User define values
ar: يحدد المستخدم القيم
id: Pengguna menentukan nilai User
ja: ユーザー定義値
th: ผู้ใช้กำหนดค่า
vi: Người dùng xác định giá trị

source: History count
ar: عدد التاريخ
id: Hitungan sejarah
ja: 履歴数
th: ประวัตินับ
vi: Lịch sử đếm

# max_age
source: Maximum age in days
ar: الحد الأقصى للعمر بالأيام
id: Usia maksimal dalam hari
ja: 最大経過日数
th: อายุสูงสุดในหน่วยวัน
vi: Tuổi tối đa tính theo ngày

# max_login_attempts
source: Maximum login to attempts
ar: الحد الأقصى لتسجيل الدخول إلى المحاولات
id: Login maksimum untuk mencoba
ja: 最大ログイン試行回数
th: เข้าสู่ระบบสูงสุดเพื่อพยายาม
vi: Đăng nhập tối đa cho các lần thử

source: Restrictions
ar: قيود
id: Pembatasan
ja: 制限事項
th: ข้อ จำกัด
vi: Những hạn chế

source: Complexity
ar: تعقيد
id: Kompleksitas
ja: 複雑
th: ความซับซ้อน
vi: Sự phức tạp

source: Others
ar: آحرون
id: Lainnya
ja: その他
th: อื่นๆ
vi: Khác

source: Update Failed
ar: فشل التحديث
id: Pembaharuan gagal
ja: アップデートに失敗しました
th: การอัพเดทล้มเหลว
vi: Cập nhật không thành công

# invalid_fields
source: All fields are not valid. Please check.
ar: جميع الحقول غير صالحة. يرجى المراجعة.
id: Semua bidang tidak valid. Silakan periksa.
ja: すべてのフィールドが無効です。 チェックしてください。
th: ฟิลด์ทั้งหมดไม่ถูกต้อง โปรดตรวจสอบ.
vi: Tất cả các trường không hợp lệ. Hãy kiểm tra.

# min_error
source: Minimum value is {min_value}
ar: القيمة الدنيا هي {min_value}
id: Nilai minimalnya adalah {min_value}
ja: 最小値は {min_value}
th: ค่าต่ำสุดคือ {min_value}
vi: Giá trị tối thiểu là {min_value}

# max_error
source: Maximum value is {max_value}
ar: القيمة القصوى هي {max_value}
id: Nilai maksimum adalah {max_value}
ja: 最大値は {max_value}
th: ค่าสูงสุดคือ {max_value}
vi: Giá trị tối đa là {max_value}

source: Teams
ar: فرق
id: Tim
ja: チーム
th: ทีม
vi: Đội

source: All
ar: الجميع
id: Semua
ja: すべて
th: ทั้งหมด
vi: Tất cả
