Repository: Fardim/sample-code-2022
Catalog: src/locale/messages.*.xlf
Languages: ar, id, ja, th, vi

source: Schedule now
ar: الجدول الزمني الآن
id: Jadwalkan sekarang
ja: 今すぐスケジュール
th: กำหนดการตอนนี้
vi: Lên lịch ngay bây giờ

source: Sync now
ar: زامن الآن "لنقل البيانات
id: Sinkronkan sekarang
ja: 今すぐ同期
th: ซิงค์เลย
vi: Đồng bộ hóa ngay bây giờ

source: Download template
ar: تحميل النموذج
id: Unduh template
ja: テンプレートをダウンロード
th: ดาวน์โหลดเทมเพลต
vi: Tải xuống mẫu

source: Upload template
ar: تحميل القالب
id: Unggah templat
ja: テンプレートをアップロード
th: อัปโหลดเทมเพลต
vi: Tải lên mẫu

source: This is a required field
ar: هذا مجال مطلوب
id: Ini adalah kolom yang harus diisi
ja: これは必要項目です
th: นี่คือข้อมูลที่จำเป็น
vi: Đây là một lĩnh vực cần thiết

source: Type and hit enter to add multiple values
ar: اكتب واضغط على Enter لإضافة قيم متعددة
id: Ketik dan tekan enter untuk menambahkan beberapa nilai
ja: 入力してEnterキーを押すと、複数の値が追加されます
th: พิมพ์และกด Enter เพื่อเพิ่มค่าหลายค่า
vi: Nhập và nhấn enter để thêm nhiều giá trị

source: Colloquials
ar: عامية
id: bahasa sehari-hari
ja: 口語
th: ภาษาปาก
vi: Thông thường

source: Language and colloquials
ar: اللغة والعامية
id: Bahasa dan bahasa sehari-hari
ja: 言語と談話
th: ภาษาและภาษาพูด
vi: Ngôn ngữ và thông tục

source: SAP characteristics
ar: خصائص SAP
id: Karakteristik SAP
ja: SAPの特徴
th: ลักษณะ SAP
vi: Đặc điểm của SAP

source: Valid to
ar: صالحة ل
id: Berlaku untuk
ja: 有効
th: ใช้ได้กับ
vi: Có hiệu lực đến

source: Valid from
ar: صالح من تاريخ
id: Berlaku dari
ja: から有効
th: ใช้ได้ตั้งแต่
vi: Có hiệu lực từ

source: Default Unit of measure
ar: وحدة القياس الافتراضية
id: Satuan ukuran default
ja: デフォルトの測定単位
th: หน่วยวัดเริ่มต้น
vi: Đơn vị đo lường mặc định

source: Dimension
ar: البعد
id: Dimensi
ja: 寸法
th: มิติ
vi: Kích thước

source: Enable for duplicate check
ar: التمكين للتحقق المكرر
id: Aktifkan untuk pemeriksaan duplikat
ja: 重複チェックを有効にする
th: เปิดใช้งานการตรวจสอบซ้ำ
vi: Cho phép kiểm tra trùng lặp

source: Allow maintaining new values
ar: السماح بالحفاظ على القيم الجديدة
id: Izinkan mempertahankan nilai-nilai baru
ja: 新しい値を維持できるようにする
th: อนุญาตให้รักษาค่าใหม่
vi: Cho phép duy trì các giá trị mới

source: Allow maintaining negative values
ar: اسمح بالحفاظ على القيم السالبة
id: Izinkan mempertahankan nilai negatif
ja: 負の値を維持できるようにする
th: อนุญาตให้รักษาค่าลบ
vi: Cho phép duy trì các giá trị âm

source: Allow maintaining data in upper case only
ar: السماح بالحفاظ على البيانات بأحرف كبيرة فقط
id: Izinkan pemeliharaan data hanya dalam huruf besar
ja: 大文字のみでデータを維持できるようにする
th: อนุญาตให้รักษาข้อมูลเป็นตัวพิมพ์ใหญ่เท่านั้น
vi: Chỉ cho phép duy trì dữ liệu bằng chữ hoa

source: Allows maintaining value range
ar: يسمح بالحفاظ على نطاق القيمة
id: Memungkinkan mempertahankan rentang nilai
ja: 値の範囲を維持できます
th: ช่วยให้รักษาช่วงค่า
vi: Cho phép duy trì phạm vi giá trị

source: Required characteristic
ar: الخاصية المطلوبة
id: Karakteristik yang diperlukan
ja: 必要な特性
th: ลักษณะที่ต้องการ
vi: Đặc điểm yêu cầu

source: Allows maintaining multiple values
ar: يسمح بالحفاظ على قيم متعددة
id: Memungkinkan mempertahankan beberapa nilai
ja: 複数の値を維持できます
th: ช่วยให้รักษาหลายค่า
vi: Cho phép duy trì nhiều giá trị

source: Characteristic suffix for long description
ar: لاحقة مميزة لوصف طويل
id: Akhiran karakteristik untuk deskripsi panjang
ja: 長い説明のための特徴的な接尾辞
th: คำต่อท้ายลักษณะสำหรับคำอธิบายแบบยาว
vi: Hậu tố đặc trưng cho mô tả dài

source: Characteristic suffix for short description
ar: لاحقة مميزة لوصف قصير
id: Akhiran karakteristik untuk deskripsi singkat
ja: 簡単な説明のための特徴的な接尾辞
th: คำต่อท้ายลักษณะสำหรับคำอธิบายสั้น ๆ
vi: Hậu tố đặc trưng cho mô tả ngắn

source: Characteristic prefix for long description
ar: بادئة مميزة لوصف طويل
id: Awalan karakteristik untuk deskripsi panjang
ja: 長い説明の特徴的な接頭辞
th: คำนำหน้าลักษณะสำหรับคำอธิบายแบบยาว
vi: Tiền tố đặc trưng cho mô tả dài

source: Characteristic prefix for short description
ar: بادئة مميزة لوصف قصير
id: Awalan karakteristik untuk deskripsi singkat
ja: 簡単な説明の特徴的な接頭辞
th: คำนำหน้าลักษณะสำหรับคำอธิบายสั้น ๆ
vi: Tiền tố đặc trưng cho mô tả ngắn

source: Currency
ar: عملة
id: Mata uang
ja: 通貨
th: สกุลเงิน
vi: Tiền tệ

source: No data type found
ar: لم يتم العثور على نوع بيانات
id: Tidak ada tipe data yang ditemukan
ja: データ型が見つかりません
th: ไม่พบประเภทข้อมูล
vi: Không tìm thấy loại dữ liệu nào

source: Characteristic type
ar: نوع مميز
id: Tipe karakteristik
ja: 特徴的なタイプ
th: ลักษณะเฉพาะประเภท
vi: Loại đặc trưng

source: Characteristic numeric code
ar: رمز رقمي مميز
id: Kode numerik karakteristik
ja: 特徴的な数値コード
th: รหัสตัวเลขลักษณะ
vi: Mã số đặc trưng

source: No data types found
ar: لم يتم العثور على أنواع البيانات
id: Tidak ada tipe data yang ditemukan
ja: データ型が見つかりません
th: ไม่พบประเภทข้อมูล
vi: Không tìm thấy loại dữ liệu nào

source: No dimensions found
ar: لم يتم العثور على أبعاد
id: Tidak ada dimensi yang ditemukan
ja: 寸法が見つかりません
th: ไม่พบมิติข้อมูล
vi: Không tìm thấy thứ nguyên

source: No unit of measure found
ar: لم يتم العثور على وحدة قياس
id: Tidak ada satuan ukuran yang ditemukan
ja: 測定単位が見つかりません
th: ไม่พบหน่วยวัด
vi: Không tìm thấy đơn vị đo lường

source: No options to show
ar: لا توجد خيارات للعرض
id: Tidak ada opsi untuk ditampilkan
ja: 表示するオプションはありません
th: ไม่มีตัวเลือกให้แสดง
vi: Không có tùy chọn để hiển thị

source: Add manually
ar: إضافة يدويا
id: Tambahkan secara manual
ja: 手動で追加
th: เพิ่มด้วยตนเอง
vi: Thêm vào một cách thủ công

source: Upload a file
ar: قم بتحميل ملف
id: Unggah file
ja: ファイルをアップロードする
th: อัปโหลดไฟล์
vi: Tải lên một tài liệu

source: Assigned characteristics
ar: الخصائص المعينة
id: Karakteristik yang ditetapkan
ja: 割り当てられた特性
th: ลักษณะที่ได้รับมอบหมาย
vi: Đặc điểm được chỉ định

source: Inherited characteristics
ar: الخصائص الموروثة
id: Karakteristik yang diwariskan
ja: 継承された特性
th: ลักษณะที่สืบทอดมา
vi: Đặc điểm kế thừa

source: WE ARE SORRY
ar: نحن اسفون
id: KAMI MINTA MAAF
ja: 申し訳ありません
th: พวกเราขอโทษ
vi: CHÚNG TÔI XIN LỖI

source: Go Back
ar: عد
id: Kembali
ja: 戻る
th: กลับไป
vi: Quay lại

# 404msg
source: We couldn't find the page you were looking for
ar: لم نتمكن من العثور على الصفحة التي تبحث عنها
id: Kami tidak dapat menemukan halaman yang Anda cari
ja: お探しのページが見つかりませんでした
th: เราไม่พบหน้าที่คุณกำลังค้นหา
vi: Chúng tôi không thể tìm thấy trang bạn đang tìm kiếm

source: Configure view
ar: تكوين العرض
id: Konfigurasi tampilan
ja: ビューを構成する
th: กำหนดค่ามุมมอง
vi: Định cấu hình chế độ xem

source: Save
ar: حفظ
id: menyimpan
ja: セーブ
th: บันทึก
vi: tiết kiệm

source: Column
ar: خانة
id: Kolom
ja: カラム
th: คอลัมน์
vi: Cột

source: Visible
ar: مرئي
id: Terlihat
ja: 目に見える
th: มองเห็นได้
vi: Có thể nhìn thấy

source: View name
ar: اسم طريقة العرض
id: Lihat nama
ja: 名前を表示
th: ดูชื่อ
vi: Xem tên

source: Search columns
ar: أعمدة البحث
id: Kolom pencarian
ja: 検索列
th: ค้นหาคอลัมน์
vi: Tìm kiếm các cột

source: New view
ar: عرض جديد
id: Pemandangan baru
ja: 新しいビュー
th: มุมมองใหม่
vi: Xem mới

source: Delete view
ar: حذف العرض
id: Hapus tampilan
ja: ビューを削除
th: ลบมุมมอง
vi: Xóa chế độ xem

source: Search...
ar: ...بحث
id: Cari...
ja: 探す...
th: ค้นหา...
vi: Tìm kiếm...

source: Enter
ar: أدخل
id: Memasukkan
ja: 入る
th: ป้อน
vi: Đi vào

source: Every
ar: كل
id: Setiap
ja: すべて
th: ทุก
vi: Mỗi

source: Occurences
ar: حوادث
id: Kejadian
ja: オカレンス
th: เหตุการณ์
vi: Sự xuất hiện

source: Upload data
ar: تحميل البيانات
id: Unggah data
ja: データをアップロードする
th: อัปโหลดข้อมูล
vi: Tải dữ liệu lên

source: Upload
ar: تحميل
id: Unggah
ja: アップロード
th: ที่อัพโหลด
vi: Tải lên

source: Select a file
ar: تحديد ملف
id: Pilih file
ja: ファイルを選択します
th: เลือกไฟล์
vi: Chọn một tập tin

# drag_drop_file
source: Drag & drop or select a file to upload
ar: قم بسحب وإسقاط أو تحديد ملف للتحميل
id: Seret & jatuhkan atau pilih file untuk diunggah
ja: ドラッグ ＆amp;アップロードするファイルをドロップまたは選択します
th: ลาก & วางหรือเลือกไฟล์ที่จะอัปโหลด
vi: Kéo & thả hoặc chọn một tệp để tải lên

source: Check data
ar: الاختيار البيانات
id: Periksa Data
ja: データをチェック
th: ตรวจสอบข้อมูล
vi: kiểm tra dữ liệu

source: Delete
ar: حذف
id: Menghapus
ja: [削除]
th: ลบ
vi: Xóa bỏ

source: Summary
ar: ملخص
id: Ringkasan
ja: 概要
th: สรุป
vi: Tóm lược

source: Business rules
ar: قواعد الاعمال
id: Peraturan bisnis
ja: ビジネスルール
th: กฎเกณฑ์ทางธุรกิจ
vi: quy tắc kinh doanh

source: Subscribers
ar: مشتركين
id: pelanggan
ja: 加入者
th: สมาชิก
vi: thuê bao

source: Schedule
ar: جدول
id: Susunan acara
ja: スケジュール
th: ตารางเวลา
vi: lịch trình

source: Statistics
ar: إحصائيات
id: statistika
ja: 統計学
th: สถิติ
vi: Số liệu thống kê

source: Business rule
ar: قاعدة العمل
id: aturan bisnis
ja: ビジネスルール
th: กฎทางธุรกิจ
vi: Quy tắc kinh doanh

source: Category
ar: فئة
id: Kategori
ja: カテゴリー
th: ประเภท
vi: thể loại

# br_category_tooltip_msg
source: Dimension of data quality to be measured
ar: البعد من جودة البيانات التي يتم قياسها
id: Dimensi kualitas data yang akan diukur
ja: データ品質の寸法を測定します
th: ขนาดของข้อมูลที่มีคุณภาพที่จะวัด
vi: Kích thước của chất lượng dữ liệu cần đo

source: Weightage
ar: الترجيح
th: น้ำหนัก

# br_weightage_tooltip_msg
source: Score assigned to a record upon successful validation of a business rule.For a schema total weightage of all the business rules must not exceed 100
ar: يسجل المخصصة الى مستوى قياسي عند التحقق من صحة الناجح لأعمال rule.For والترجيح مجموعه مخطط لجميع قواعد العمل يجب ألا يتجاوز 100
id: Skor ditugaskan ke rekor pada validasi sukses bisnis rule.For skema keseluruhan weightage dari semua aturan bisnis tidak boleh melebihi 100
ja: スコアのすべてのビジネス・ルールのスキーマ合計weightageが100を超えてはならないrule.For事業の検証が成功したときにレコードに割り当て
th: คะแนนที่ได้รับมอบหมายเป็นประวัติการณ์เมื่อตรวจสอบที่ประสบความสำเร็จของธุรกิจ rule.For weightage สคีรวมของกฎเกณฑ์ทางธุรกิจจะต้องไม่เกิน 100
vi: Điểm giao lên mức kỷ lục khi xác nhận thành công của một doanh nghiệp rule.For tổng schema weightage của tất cả các quy tắc kinh doanh không được vượt quá 100

source: Enabled
ar: تمكين
id: Diaktifkan
ja: 使用可能
th: เปิดการใช้งาน
vi: Bật

source: Type rule name to add
ar: اكتب اسم القاعدة لإضافة
id: Ketik nama aturan untuk menambahkan
ja: 追加するには、ルール名を入力します
th: พิมพ์ชื่อกฎที่จะเพิ่ม
vi: Nhập tên quy tắc để thêm

source: Rule type
ar: نوع القاعدة
id: jenis aturan
ja: ルールのタイプ
th: ประเภทกฎ
vi: loại quy tắc

# rule_type_missing_msg
source: Please enter rule type
ar: الرجاء إدخال نوع الحكم
id: Masukkan jenis aturan
ja: ルールタイプを入力してください。
th: กรุณากรอกประเภทกฎ
vi: Vui lòng nhập loại quy tắc

# weightage_missing_msg
source: Please enter Weightage
ar: الرجاء إدخال الترجيح
id: Masukkan weightage
ja: Weightageを入力してください。
th: กรุณากรอก weightage
vi: Vui lòng nhập weightage

# category_id_missing_msg
source: Please enter Category Id
ar: الرجاء إدخال رقم تعريف فئة
id: Masukkan Kategori Id
ja: カテゴリーIDを入力してください
th: กรุณากรอกรหัสหมวดหมู่
vi: Vui lòng nhập Id loại

# rule_name_desc
source: Rule name (Description)
ar: اسم القاعدة (الوصف)
id: nama aturan (Keterangan)
ja: ルール名（説明）
th: ชื่อกฎ (รายละเอียด)
vi: Tên quy tắc (Mô tả)

source: Error message
ar: رسالة خطأ
id: Pesan eror
ja: エラーメッセージ
th: ข้อความผิดพลาด
vi: Thông báo lỗi

source: Fields
ar: مجالات
ja: 田畑
th: ทุ่ง
vi: Lĩnh vực

source: Field
ar: حقل
id: Bidang
ja: フィールド
th: สนาม
vi: Cánh đồng

source: Match
ar: مباراة
id: Pertandingan
ja: 一致
th: การแข่งขัน
vi: Trận đấu

source: Exclusions
ar: الاستثناءات
id: pengecualian
ja: 除外
th: การยกเว้น
vi: Loại trừ

# pls_select_value
source: Please select value
ar: الرجاء تحديد قيمة
id: Silakan pilih nilai
ja: 値を選択してください
th: โปรดเลือกค่า
vi: Vui lòng chọn giá trị

source: Nothing to see here
ar: لا شيء لنرى هنا
id: Tidak ada yang bisa dilihat di sini
ja: ここで参照するには何もありません
th: ไม่มีอะไรให้ดูที่นี่
vi: Không có gì để thấy ở đây

# type_inside_search_box_to_find_fields
source: Type inside the search box to find fields
ar: اكتب داخل مربع البحث للعثور على حقول
id: Ketik di dalam kotak pencarian untuk menemukan ladang
ja: フィールドを見つけるために検索ボックス内に入力
th: พิมพ์ในช่องค้นหาเพื่อค้นหาสาขา
vi: Gõ bên trong hộp tìm kiếm để tìm các lĩnh vực

source: Master record parameters
ar: المعلمات السجل الرئيسي
id: parameter rekaman master
ja: マスター・レコード・パラメータ
th: พารามิเตอร์บันทึกปริญญาโท
vi: thông số kỷ lục Thạc sĩ

source: Parameter
ar: معامل
ja: パラメーター
th: พารามิเตอร์
vi: Tham số

source: Attribute
ar: ينسب
id: Atribut
ja: 属性
th: คุณลักษณะ
vi: đặc tính

# pls_select_field
source: Please select field
ar: يرجى تحديد الحقل
id: Silakan pilih bidang
ja: フィールドを選択してください
th: กรุณาเลือกข้อมูล
vi: Vui lòng chọn lĩnh vực

# type_inside_search_box_to_find_master
source: Type inside the search box to find master records
ar: اكتب داخل مربع البحث للعثور على السجلات الرئيسية
id: Ketik di dalam kotak pencarian untuk menemukan catatan master
ja: マスタレコードを見つけるために検索ボックス内に入力
th: พิมพ์ในช่องค้นหาเพื่อหาเรคคอร์ดหลัก
vi: Gõ bên trong hộp tìm kiếm để tìm hồ sơ tổng thể

source: Threshold
ar: عتبة
id: Ambang
ja: しきい値
th: ธรณีประตู
vi: ngưỡng

source: Data scope
ar: نطاق البيانات
id: lingkup Data
ja: データスコープ
th: ขอบเขตข้อมูล
vi: phạm vi dữ liệu

source: Add data scope
ar: نطاق إضافة البيانات
id: lingkup Data add
ja: データスコープを追加します。
th: ขอบเขตข้อมูลเพิ่ม
vi: phạm vi dữ liệu Add

source: Name
ar: اسم
id: Nama
ja: 名前
th: ชื่อ
vi: Tên

source: Scope
ar: مجال
id: Cakupan
ja: 範囲
th: ขอบเขต
vi: Phạm vi

source: Schema name
ar: اسم المخطط
id: nama skema
ja: スキーマ名
th: ชื่อสกี
vi: tên Schema

source: close
ar: أغلق
id: Menutup
ja: 閉じる
th: ปิด
vi: đóng

source: Reset all
ar: إعادة ضبط الجميع
id: Setel ulang semua
ja: すべてリセット
th: การตั้งค่าทั้งหมด
vi: Đặt lại tất cả

source: Apply filters...
ar: ...تطبيق عوامل التصفية
id: Terapkan filter ...
ja: フィルタを適用します。
th: ใช้ตัวกรอง ...
vi: Áp dụng các bộ lọc...

source: Apply
ar: تطبيق
id: Menerapkan
ja: 適用する
th: สมัคร
vi: Ứng dụng

source: type filter value
ar: اكتب قيمة التصفية
id: ketik nilai filter
ja: タイプフィルター値
th: พิมพ์ค่าตัวกรอง
vi: nhập giá trị bộ lọc

source: Save as...
ar: ...حفظ باسم
id: Simpan sebagai ...
ja: 名前を付けて保存...
th: บันทึกเป็น...
vi: Lưu thành...

source: Reset
ar: إعادة ضبط
id: Setel ulang
ja: リセット
th: รีเซ็ต
vi: Cài lại

source: Save filter as...
ar: ...حفظ عامل التصفية باسم
id: Simpan filter sebagai ...
ja: フィルタを名前を付けて保存...
th: บันทึกตัวกรองเป็น ...
vi: Lưu bộ lọc dưới dạng ...

source: Filter name
ar: اسم المرشح
id: Nama filter
ja: フィルタ名
th: ชื่อตัวกรอง
vi: Tên bộ lọc

source: Cancel
ar: إلغاء
id: Membatalkan
ja: キャンセル
th: ยกเลิก
vi: Huỷ bỏ

source: Home
ar: منزل، بيت
id: Rumah
ja: 家
th: บ้าน
vi: Trang Chủ

source: Data
ar: البيانات
ja: データ
th: ข้อมูล
vi: Dữ liệu

source: Schema
ar: مخطط
id: Skema
ja: スキーマ
th: สคีมา
vi: Lược đồ

source: Reports
ar: تقارير
ja: レポート
th: รายงาน
vi: Báo cáo

source: Sign out
ar: خروج
id: Keluar
ja: サインアウト
th: ออกจากระบบ
vi: Đăng xuất

source: New module
ar: وحدة جديدة
id: modul baru
ja: 新モジュール
th: โมดูลใหม่
vi: Module mới

source: New schema
ar: مخطط جديد
id: skema baru
ja: 新しいスキーマ
th: คีมาใหม่
vi: schema mới

source: System tray
ar: علبة النظام
ja: システムトレイ
th: ถาดระบบ
vi: Khay hệ thống

source: Notifications
ar: إشعارات
id: pemberitahuan
ja: 通知
th: การแจ้งเตือน
vi: thông báo

source: Job query
ar: الاستعلام وظيفة
id: permintaan pekerjaan
ja: 求人の問い合わせ
th: แบบสอบถามงาน
vi: truy vấn Job

source: Daily
ar: اليومي
id: Harian
ja: 日々
th: ประจำวัน
vi: hằng ngày

source: Weekly
ar: أسبوعي
id: Mingguan
ja: ウィークリー
th: รายสัปดาห์
vi: hàng tuần

source: Monthly
ar: شهريا
id: Bulanan
ja: 毎月
th: รายเดือน
vi: hằng tháng

source: Yearly
ar: سنوي
id: Tahunan
ja: 毎年
th: รายปี
vi: hàng năm

# display_in_label
source: Display in:
ar: عرض في:
id: Tampilan di:
ja: で表示します。
th: แสดงใน:
vi: Hiển thị trong:

# date_label
source: Date:
ar: تاريخ:
id: Tanggal:
ja: 日付：
th: วันที่:
vi: Ngày:

source: Today
ar: اليوم
id: Hari ini
ja: 今日
th: ในวันนี้
vi: Hôm nay

source: This week
ar: هذا الاسبوع
id: Minggu ini
ja: 今週
th: ในสัปดาห์นี้
vi: Tuần này

source: This month
ar: هذا الشهر
id: Bulan ini
ja: 今月
th: เดือนนี้
vi: Tháng này

source: Specific date
ar: موعد محدد
id: Tanggal yang spesifik
ja: 特定の日付
th: วันที่เฉพาะเจาะจง
vi: ngày cụ thể

source: Date range
ar: نطاق الموعد
id: rentang tanggal
ja: 日付範囲
th: ช่วงวันที่
vi: phạm vi ngày

source: Start date
ar: تاريخ البدء
id: Mulai tanggal
ja: 開始日
th: วันที่เริ่มต้น
vi: ngày bắt đầu

source: End date
ar: تاريخ الانتهاء
id: tanggal akhir
ja: 終了日
th: วันที่สิ้นสุด
vi: Ngày cuối

# data_scope_label
source: Data scope :
ar: نطاق البيانات:
id: Data lingkup:
ja: データスコープ：
th: ขอบเขตของข้อมูล:
vi: phạm vi dữ liệu:

source: Schema execution trends
ar: اتجاهات تنفيذ مخطط
id: tren eksekusi skema
ja: スキーマの実行動向
th: แนวโน้มการดำเนิน Schema
vi: xu hướng thực hiện Schema

source: Search
ar: يبحث
id: Cari...
ja: 探す...
th: ค้นหา...
vi: Tìm kiếm...

source: Duplicate report
ar: تقرير مكرر
id: Laporan duplikat
ja: 重複レポート
th: รายงานซ้ำ
vi: Báo cáo trùng lặp

source: Report
ar: نقل
id: Melaporkan
ja: 報告書
th: รายงาน
vi: Báo cáo

source: Retry
ar: أعد المحاولة
id: Mencoba kembali
ja: リトライ
th: ลองอีกครั้ง
vi: Thử lại

source: Confirm
ar: يتأكد
id: Konfirmasi
ja: 確認
th: ยืนยัน
vi: Xác nhận

source: Check
ar: الشيك
id: Memeriksa
ja: 小切手
th: ตรวจสอบ
vi: Kiểm tra

source: Entire data scope
ar: نطاق البيانات بالكامل
id: lingkup seluruh data
ja: 全体のデータスコープ
th: ขอบเขตข้อมูลทั้งหมด
vi: phạm vi dữ liệu toàn bộ

# run_rule_warning_msg
source: Only run this rule if the preceding rule returns
ar: فقط تشغيل هذه القاعدة إذا ما تقدم عوائد حكم
id: Hanya menjalankan aturan ini jika sebelumnya kembali aturan
ja: ルールリターンの前にいる場合のみ、このルールを実行します
th: ทำงานเฉพาะกฎนี้ถ้าก่อนหน้านี้ผลตอบแทนการปกครอง
vi: Chỉ chạy quy tắc này nếu trước đó trở lại quy tắc

# brs_null_message
source: You don't have any business rules selected. Type the business rule in the box above to add one.
ar: ليس لديك أي قواعد العمل المحدد. اكتب قاعدة العمل في المربع أعلاه لإضافة واحد.
id: Anda tidak memiliki aturan bisnis yang dipilih. Ketik aturan bisnis di kotak di atas untuk menambahkan satu.
ja: 選択した任意のビジネスルールを持っていません。 1を追加するには、上のボックスにビジネスルールを入力します。
th: คุณไม่ได้มีกฎเกณฑ์ทางธุรกิจใด ๆ ที่เลือก พิมพ์กฎทางธุรกิจในช่องด้านบนเพื่อเพิ่มหนึ่ง
vi: Bạn không có bất kỳ quy tắc kinh doanh được lựa chọn. Gõ quy tắc kinh doanh trong hộp ở trên để thêm một.

source: Subscriber
ar: مكتتب
id: langganan
ja: 加入者
th: สมาชิก
vi: Người đăng kí

source: Role
ar: دور
id: Wewenang
ja: 役割
th: บทบาท
vi: Vai trò

source: Data allocation
ar: توزيع البيانات
id: alokasi Data
ja: データの割り当て
th: การจัดสรรข้อมูล
vi: phân bổ dữ liệu

# type_subscriber_name
source: Type subscriber name to add
ar: اكتب اسم المشترك لإضافة
id: Ketik nama pelanggan untuk menambahkan
ja: 追加するには、加入者名を入力します
th: พิมพ์ชื่อสมาชิกที่จะเพิ่ม
vi: Nhập tên thuê bao thêm

# invite_people_to_team
source: Invite people to your team
ar: دعوة الناس إلى فريقك
id: Undang orang untuk tim Anda
ja: あなたのチームに人を招待
th: เชิญคนในทีมของคุณ
vi: Mời mọi người vào nhóm của bạn

source: Admin
ar: مشرف
ja: 管理者
th: ผู้ดูแลระบบ
vi: quản trị viên

source: Reviewer
ar: مراجع
id: resensi
ja: レビュー
th: ผู้วิจารณ์

source: Viewer
ar: مشاهد
id: Penonton
ja: ビューア
th: ผู้ชม
vi: Người xem

source: Editor
ar: محرر
ja: 編集者
th: บรรณาธิการ
vi: Biên tập viên

# subscriber_null_message
source: You don't have any subscribers selected. Type the user's name in the box above to add one.
ar: لم يكن لديك أي مشترك المحدد. اكتب اسم المستخدم في المربع أعلاه لإضافة واحد.
id: Anda tidak memiliki pelanggan apapun yang dipilih. Ketik nama pengguna di kotak di atas untuk menambahkan satu.
ja: あなたは、任意の加入者が選択されていません。 1を追加するには、上のボックスにユーザーの名前を入力します。
th: คุณไม่ได้มีสมาชิกที่เลือก พิมพ์ชื่อผู้ใช้ในช่องด้านบนเพื่อเพิ่มหนึ่ง
vi: Bạn không có bất kỳ thuê bao lựa chọn. Nhập tên của người dùng vào ô bên trên để thêm một.

source: Add subscribers
ar: إضافة المشتركين
id: pelanggan add
ja: 加入者を追加します。
th: เพิ่มสมาชิก
vi: Thêm thuê bao

source: Search subscribers
ar: بحث مشترك
id: pelanggan pencarian
ja: 検索の加入者
th: สมาชิกค้นหา
vi: thuê bao tìm kiếm

source: Add
ar: يضيف
id: Menambahkan
ja: 追加
th: เพิ่ม
vi: Thêm vào

source: Invite
ar: يدعو
id: Undang
ja: 招待する
th: เชิญ
vi: Mời gọi

source: Add user
ar: إضافة المستخدم
id: Tambahkan pengguna
ja: ユーザーを追加する
th: เพิ่มผู้ใช้
vi: Thêm người dùng

source: Email address
ar: عنوان البريد الإلكتروني
id: Alamat email
ja: 電子メールアドレス
th: ที่อยู่อีเมล
vi: Địa chỉ email

# email_required
source: Email is required
ar: البريد الالكتروني مطلوب
id: Email diperlukan
ja: メールが要求されます
th: อีเมล์เป็นสิ่งจำเป็น
vi: Email thì cần thiết

# role_required
source: Role is required
ar: مطلوب دور
id: Peran diperlukan
ja: 役割が必要です
th: บทบาทเป็นสิ่งจำเป็น
vi: Vai trò là cần thiết

source: Settings
ar: إعدادات
id: pengaturan
ja: 設定
th: การตั้งค่า
vi: Cài đặt

source: Sort by
ar: ترتيب حسب
id: Sortir dengan
ja: 並び替え
th: เรียงตาม
vi: Sắp xếp theo

source: Ascending
ar: تصاعدي
id: Naik
ja: 上昇
th: จากน้อยไปมาก
vi: Tăng dần

source: Descending
ar: تنازلي
id: Menurun
ja: 降順
th: จากมากไปน้อย
vi: Giảm dần

source: Row ascending
ar: صف تصاعدي
id: Baris menaik
ja: 行の昇順
th: แถวจากน้อยไปมาก
vi: Hàng tăng dần

source: Row descending
ar: صف تنازلي
id: Baris menurun
ja: 行の降順
th: แถวจากมากไปน้อย
vi: Hàng giảm dần

source: Column Ascending
ar: العمود تصاعديًا
id: Kolom Menaik
ja: 列の昇順
th: คอลัมน์จากน้อยไปมาก
vi: Cột tăng dần

source: Column descending
ar: العمود تنازلي
id: Kolom menurun
ja: 列の降順
th: คอลัมน์จากมากไปหาน้อย
vi: Cột giảm dần

source: Entire dataset
ar: مجموعة البيانات بأكملها
id: seluruh dataset
ja: データセット全体
th: ชุดข้อมูลทั้งหมด
vi: toàn bộ số liệu

source: New data scope
ar: نطاق البيانات الجديد
id: lingkup data baru
ja: 新しいデータスコープ
th: ขอบเขตข้อมูลใหม่
vi: phạm vi dữ liệu mới

source: Export to CSV
ar: تصدير إلى CSV
id: Ekspor ke CSV
ja: CSVへのエクスポート
th: ส่งออกเป็น CSV
vi: Xuất khẩu sang CSV

source: Import from CSV
ar: الاستيراد من CSV
id: Impor dari CSV
ja: CSVからのインポート
th: นำเข้าจาก CSV
vi: Nhập khẩu từ CSV

source: Errors
ar: أخطاء
id: kesalahan
ja: エラー
th: ข้อผิดพลาด
vi: lỗi

source: Success
ar: نجاح
id: Keberhasilan
ja: 成功
th: ความสำเร็จ
vi: Sự thành công

source: Corrections
ar: تصحيحات
id: koreksi
ja: 訂正
th: ราชทัณฑ์
vi: Đính chính

source: Header
ar: رأس
ja: ヘッダ
th: หัวข้อ
vi: cú đội đầu

source: Plant data
ar: بيانات المصنع
id: Data tanaman
ja: プラントデータ
th: ข้อมูลโรงงาน
vi: dữ liệu thực vật

source: Valuation data
ar: بيانات التقييم
id: Data valuasi
ja: 評価データ
th: ข้อมูลการประเมิน
vi: dữ liệu định giá

source: Language table
ar: جدول اللغات
id: meja bahasa
ja: 言語テーブル
th: ตารางภาษา
vi: bảng ngôn ngữ

# all_unit_of_measure
source: Alt unit of measure
ar: وحدة القياس البديل
id: Unit Alt ukuran
ja: 対策のAltキーユニット
th: หน่วย Alt ของการวัด
vi: đơn vị Alt đo lường

source: Approve
ar: يوافق
id: Menyetujui
ja: 認めます
th: อนุมัติ
vi: Phê duyệt

source: Reject
ar: رفض
id: Menolak
ja: 拒絶します
th: ปฏิเสธ
vi: Từ chối

source: Unselect
ar: إلغاء تحديد
ja: 選択を解除
th: ยกเลิกการเลือก
vi: Bỏ chọn

source: Score
ar: نتيجة
id: Skor
ja: スコア
th: คะแนน
vi: Ghi bàn

source: Object Number
ar: عدد الكائن
id: Jumlah objek
ja: オブジェクト番号
th: จำนวนวัตถุ
vi: Số đối tượng

source: Create
ar: يخلق
id: Membuat
ja: 作ります
th: สร้าง
vi: Tạo nên

source: Columns
ar: أعمدة
id: kolom
ja: コラム
th: คอลัมน์
vi: Cột

source: Editable
ar: قابل للتعديل
id: diedit
ja: 編集可能
th: ที่สามารถแก้ไขได้

source: Preview
ar: معاينة
ja: 試写
th: ดูตัวอย่าง
vi: Xem trước

source: Action
ar: عمل
id: Tindakan
ja: アクション
th: หนังบู๊
vi: Hoạt động

source: Primary
ar: خبرات
id: Utama
ja: 主要
th: ประถม
vi: Sơ cấp

source: New custom action
ar: إجراء مخصص جديد
id: tindakan kustom baru
ja: 新しいカスタムアクション
th: การกระทำที่กำหนดเองใหม่
vi: hành động tùy chỉnh mới

source: Business rule library
ar: مكتبة قاعدة العمل
id: perpustakaan aturan bisnis
ja: ビジネス・ルール・ライブラリー
th: ห้องสมุดกฎทางธุรกิจ
vi: thư viện quy tắc kinh doanh

source: Business rule type
ar: نوع قاعدة العمل
id: jenis aturan bisnis
ja: ビジネスルールの種類
th: ประเภทกฎทางธุรกิจ
vi: loại quy tắc kinh doanh

source: Profile
ar: الملف الشخصي
id: Profil
ja: プロフィール
th: ข้อมูลส่วนตัว
vi: Hồ sơ

source: Personal Details
ar: تفاصيل شخصية
id: Data pribadi
ja: 個人的な詳細
th: ข้อมูลส่วนตัว
vi: Thông tin cá nhân

source: Username
ar: اسم المستخدم
id: Nama pengguna
ja: ユーザー名
th: ชื่อผู้ใช้
vi: tên tài khoản

source: Full Name
ar: الاسم بالكامل
id: Nama lengkap
ja: フルネーム
th: ชื่อเต็ม
vi: Họ và tên
